renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
/***********************************************************************************************************************
 * Copyright [2020-2022] Renesas Electronics Corporation and/or its affiliates.  All Rights Reserved.
 *
 * This software and documentation are supplied by Renesas Electronics America Inc. and may only be used with products
 * of Renesas Electronics Corp. and its affiliates ("Renesas").  No other uses are authorized.  Renesas products are
 * sold pursuant to Renesas terms and conditions of sale.  Purchasers are solely responsible for the selection and use
 * of Renesas products and Renesas assumes no liability.  No license, express or implied, to any intellectual property
 * right is granted by Renesas. This software is protected under all applicable laws, including copyright laws. Renesas
 * reserves the right to change or discontinue this software and/or this documentation. THE SOFTWARE AND DOCUMENTATION
 * IS DELIVERED TO YOU "AS IS," AND RENESAS MAKES NO REPRESENTATIONS OR WARRANTIES, AND TO THE FULLEST EXTENT
 * PERMISSIBLE UNDER APPLICABLE LAW, DISCLAIMS ALL WARRANTIES, WHETHER EXPLICITLY OR IMPLICITLY, INCLUDING WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NONINFRINGEMENT, WITH RESPECT TO THE SOFTWARE OR
 * DOCUMENTATION.  RENESAS SHALL HAVE NO LIABILITY ARISING OUT OF ANY SECURITY VULNERABILITY OR BREACH.  TO THE MAXIMUM
 * EXTENT PERMITTED BY LAW, IN NO EVENT WILL RENESAS BE LIABLE TO YOU IN CONNECTION WITH THE SOFTWARE OR DOCUMENTATION
 * (OR ANY PERSON OR ENTITY CLAIMING RIGHTS DERIVED FROM YOU) FOR ANY LOSS, DAMAGES, OR CLAIMS WHATSOEVER, INCLUDING,
 * WITHOUT LIMITATION, ANY DIRECT, CONSEQUENTIAL, SPECIAL, INDIRECT, PUNITIVE, OR INCIDENTAL DAMAGES; ANY LOST PROFITS,
 * OTHER ECONOMIC DAMAGE, PROPERTY DAMAGE, OR PERSONAL INJURY; AND EVEN IF RENESAS HAS BEEN ADVISED OF THE POSSIBILITY
 * OF SUCH LOSS, DAMAGES, CLAIMS OR COSTS.
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Includes
 **********************************************************************************************************************/
#include <stdio.h>

/* Cellular module includes. */
#include "r_aws_cellular_if.h"

/***********************************************************************************************************************
 * Macro definitions
 **********************************************************************************************************************/
#ifndef RM_CELLULAR_RYZ_PDN_ACT_PACKET_REQ_TIMEOUT_MS
 #define RM_CELLULAR_RYZ_PDN_ACT_PACKET_REQ_TIMEOUT_MS              AWS_CELLULAR_CFG_AT_COMMAND_TIMEOUT //(150000UL)
#endif
#ifndef RM_CELLULAR_RYZ_PDN_DEACT_PACKET_REQ_TIMEOUT_MS
 #define RM_CELLULAR_RYZ_PDN_DEACT_PACKET_REQ_TIMEOUT_MS            AWS_CELLULAR_CFG_AT_COMMAND_TIMEOUT //(40000UL)
#endif
#ifndef RM_CELLULAR_RYZ_GPRS_ATTACH_REQ_TIMEOUT_MS
 #define RM_CELLULAR_RYZ_GPRS_ATTACH_REQ_TIMEOUT_MS                 AWS_CELLULAR_CFG_AT_COMMAND_TIMEOUT //(180000UL)
#endif
#ifndef RM_CELLULAR_RYZ_DNS_QUERY_REQ_TIMEOUT_MS
 #define RM_CELLULAR_RYZ_DNS_QUERY_REQ_TIMEOUT_MS                   AWS_CELLULAR_CFG_AT_COMMAND_TIMEOUT //(120000UL)
#endif
#ifndef RM_CELLULAR_RYZ_SOCKET_CONNECT_PACKET_REQ_TIMEOUT_MS
 #define RM_CELLULAR_RYZ_SOCKET_CONNECT_PACKET_REQ_TIMEOUT_MS       AWS_CELLULAR_CFG_AT_COMMAND_TIMEOUT //(120000U)
#endif
#ifndef RM_CELLULAR_RYZ_PACKET_REQ_TIMEOUT_MS
 #define RM_CELLULAR_RYZ_PACKET_REQ_TIMEOUT_MS                      AWS_CELLULAR_CFG_AT_COMMAND_TIMEOUT //(10000U)
#endif
#ifndef RM_CELLULAR_RYZ_DATA_SEND_TIMEOUT_MS
 #define RM_CELLULAR_RYZ_DATA_SEND_TIMEOUT_MS                       AWS_CELLULAR_CFG_AT_COMMAND_TIMEOUT //(10000U)
#endif
#ifndef RM_CELLULAR_RYZ_DATA_SEND_INTER_DELAY_MS
 #define RM_CELLULAR_RYZ_DATA_SEND_INTER_DELAY_MS                   AWS_CELLULAR_CFG_SEND_DELAY //(200U)
#endif
#ifndef RM_CELLULAR_RYZ_DATA_READ_TIMEOUT_MS
 #define RM_CELLULAR_RYZ_DATA_READ_TIMEOUT_MS                       AWS_CELLULAR_CFG_AT_COMMAND_TIMEOUT //(50000UL)
#endif
#ifndef RM_CELLULAR_RYZ_SOCKET_DISCONNECT_PACKET_REQ_TIMEOUT_MS
 #define RM_CELLULAR_RYZ_SOCKET_DISCONNECT_PACKET_REQ_TIMEOUT_MS    AWS_CELLULAR_CFG_AT_COMMAND_TIMEOUT //(12000UL)
#endif

#define RM_CELLULAR_RYZ_SOCKET_DATA_PREFIX_TOKEN                    "+SQNSRECV: "
#define RM_CELLULAR_RYZ_SOCKET_DATA_PREFIX_TOKEN_LEN                (11U)
#define RM_CELLULAR_RYZ_SOCKET_DATA_PREFIX_STRING_LENGTH            (SOCKET_DATA_PREFIX_TOKEN_LEN + 6U)
#define RM_CELLULAR_RYZ_MAX_SQNSSRECV_STRING_PREFIX_STRING          (21U)            // The max data prefix string is "+SQNSRECV: 1,1500\r\n"
#define RM_CELLULAR_RYZ_DATA_PREFIX_STRING_CHANGELINE_LENGTH        (2U)             // The length of the change line "\r\n".
#define RM_CELLULAR_RYZ_GET_MODEM_SOCKET_ID(socket_id)    ((uint16_t) socket_id + 1) // Socket ID on modem starts at index 1
#define RM_CELLULAR_RYZ_CRSM_HPLMN_RAT_LENGTH                       (9U)

#define RM_CELLULAR_MAX_NVM_CERTIFICATE_INDEX  (19)    /* Maximum Certificate Index Number  */
#define RM_CELLULAR_SECURITY_PROFILE_ID_H      (6)     /* Maximum Security Profile ID Number  */
#define RM_CELLULAR_SECURITY_PROFILE_ID_L      (1)     /* Minimum Security Profile ID Number  */
#define RM_CELLULAR_NVM_CERTIFICATE_SIZE_H     (16384) /* Maximum Certificate File Size */
#define RM_CELLULAR_NVM_CERTIFICATE_SIZE_L     (1)     /* Minimum Certificate File Size */

#define PRINTF_BINARY_PATTERN_INT4          "%c%c%c%c"
#define PRINTF_BYTE_TO_BINARY_INT4( i )          \
    ( ( ( ( i ) & 0x08U ) != 0U ) ? '1' : '0' ), \
    ( ( ( ( i ) & 0x04U ) != 0U ) ? '1' : '0' ), \
    ( ( ( ( i ) & 0x02U ) != 0U ) ? '1' : '0' ), \
    ( ( ( ( i ) & 0x01U ) != 0U ) ? '1' : '0' )

/***********************************************************************************************************************
 * Typedef definitions
 **********************************************************************************************************************/
typedef struct _socketDataRecv
{
    uint32_t * pDataLen;
    uint8_t  * pData;
} _socketDataRecv_t;

