renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
/***********************************************************************************************************************
 * Private function prototypes
 **********************************************************************************************************************/
static CellularError_t _Cellular_GetContextActivationStatus(CellularHandle_t              cellularHandle,
                                                            CellularPdnContextActInfo_t * pPdpContextsActInfo);
static CellularError_t     _Cellular_GetPacketSwitchStatus(CellularHandle_t cellularHandle, bool * pPacketSwitchStatus);
static CellularPktStatus_t _Cellular_RecvFuncGetPdpContextActState(CellularContext_t                 * pContext,
                                                                   const CellularATCommandResponse_t * pAtResp,
                                                                   void                              * pData,
                                                                   uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncPacketSwitchStatus(CellularContext_t                 * pContext,
                                                                const CellularATCommandResponse_t * pAtResp,
                                                                void                              * pData,
                                                                uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetPdpContextSettings(CellularContext_t                 * pContext,
                                                                   const CellularATCommandResponse_t * pAtResp,
                                                                   void                              * pData,
                                                                   uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetSignalInfo(CellularContext_t                 * pContext,
                                                           const CellularATCommandResponse_t * pAtResp,
                                                           void                              * pData,
                                                           uint16_t                            dataLen);
static bool                _parseExtendedSignalQuality(char * pQcsqPayload, CellularSignalInfo_t * pSignalInfo);
static bool                _parseSignalQuality(char * pQcsqPayload, CellularSignalInfo_t * pSignalInfo);
static CellularPktStatus_t _Cellular_RecvFuncResolveDomainToIpAddress(CellularContext_t                 * pContext,
                                                                      const CellularATCommandResponse_t * pAtResp,
                                                                      void                              * pData,
                                                                      uint16_t                            dataLen);
static CellularPktStatus_t socketSendDataPrefix(void * pCallbackContext, char * pLine, uint32_t * pBytesRead);
static CellularPktStatus_t _Cellular_RecvFuncData(CellularContext_t                 * pContext,
                                                  const CellularATCommandResponse_t * pAtResp,
                                                  void                              * pData,
                                                  uint16_t                            dataLen);
static CellularATError_t getDataFromResp(const CellularATCommandResponse_t * pAtResp,
                                         const _socketDataRecv_t           * pDataRecv,
                                         uint32_t                            outBufSize);
static CellularPktStatus_t socketRecvDataPrefix(void     * pCallbackContext,
                                                char     * pLine,
                                                uint32_t   lineLength,
                                                char    ** ppDataStart,
                                                uint32_t * pDataLength);
static bool                _checkCrsmMemoryStatus(const char * pToken);
static bool                _checkCrsmReadStatus(const char * pToken);
static bool                _parseHplmn(char * pToken, void * pData);
static CellularPktStatus_t _Cellular_RecvFuncGetHplmn(CellularContext_t                 * pContext,
                                                      const CellularATCommandResponse_t * pAtResp,
                                                      void                              * pData,
                                                      uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetIccid(CellularContext_t                 * pContext,
                                                      const CellularATCommandResponse_t * pAtResp,
                                                      void                              * pData,
                                                      uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetImsi(CellularContext_t                 * pContext,
                                                     const CellularATCommandResponse_t * pAtResp,
                                                     void                              * pData,
                                                     uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetNetworkReg(CellularContext_t                 * pContext,
                                                           const CellularATCommandResponse_t * pAtResp,
                                                           void                              * pData,
                                                           uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncUpdateMccMnc(CellularContext_t                 * pContext,
                                                          const CellularATCommandResponse_t * pAtResp,
                                                          void                              * pData,
                                                          uint16_t                            dataLen);

