renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
static CellularPktStatus_t _Cellular_RecvFuncGetPhoneNum (CellularContext_t                 * p_context,
                                                          const CellularATCommandResponse_t * p_atresp,
                                                          void                              * p_data,
                                                          uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncPingEcho (CellularContext_t                 * pContext,
                                                       const CellularATCommandResponse_t * pAtResp,
                                                       void                              * pData,
                                                       uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetOperatorName (CellularContext_t                 * pContext,
                                                              const CellularATCommandResponse_t * pAtResp,
                                                              void                              * pData,
                                                              uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetUpgradeState (CellularContext_t                 * p_context,
                                                              const CellularATCommandResponse_t * p_atresp,
                                                              void                              * p_data,
                                                              uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetCertificate (CellularContext_t                  * pContext,
                                                              const CellularATCommandResponse_t * pAtResp,
                                                              void                              * pData,
                                                              uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetString (CellularContext_t                 * p_context,
                                                        const CellularATCommandResponse_t * p_atresp,
                                                        void                              * p_data,
                                                        uint16_t                            dataLen);
static CellularATError_t _Cellular_ATGetSpecificNextTok (uint8_t      ** pp_String,
                                                         const uint8_t * p_Delimiter,
                                                         uint8_t      ** pp_TokOutput);
static CellularPktStatus_t _Cellular_RecvFuncStartDownLink (CellularContext_t                 * pContext,
                                                            const CellularATCommandResponse_t * pAtResp,
                                                            void                              * pData,
                                                            uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetSVN (CellularContext_t                 * p_context,
                                                     const CellularATCommandResponse_t * p_atresp,
                                                     void                              * p_data,
                                                     uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetSocketDataSize (CellularContext_t                 * p_context,
                                                                const CellularATCommandResponse_t * p_atresp,
                                                                void                              * p_data,
                                                                uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetRAT (CellularContext_t                 * p_context,
                                                     const CellularATCommandResponse_t * p_atresp,
                                                     void                              * p_data,
                                                     uint16_t                            dataLen);
static CellularPktStatus_t _Cellular_RecvFuncGetSupportRAT (CellularContext_t                 * p_context,
                                                            const CellularATCommandResponse_t * p_atresp,
                                                            void                              * p_data,
                                                            uint16_t                            dataLen);
static bool _parseGetHostByName (char * pQcsqPayload, char * pSignalInfo);
static bool _parseGetPhoneNum (uint8_t * p_QcsqPayload, uint8_t * p_GetPhonenum);

/***********************************************************************************************************************
 * Global Variables
 **********************************************************************************************************************/

/* Implementation of Cellular_Init */
CellularError_t Cellular_Init (CellularHandle_t * pCellularHandle, const CellularCommInterface_t * pCommInterface)
{
    CellularError_t cellularStatus = CELLULAR_SUCCESS;

    CellularTokenTable_t cellularTokenTable =
    {
        .pCellularUrcHandlerTable              = cellular_urc_handler_table,
        .cellularPrefixToParserMapSize         = cellular_urc_handler_table_size,
        .pCellularSrcTokenErrorTable           = CellularSrcTokenErrorTable,
        .cellularSrcTokenErrorTableSize        = CellularSrcTokenErrorTableSize,
        .pCellularSrcTokenSuccessTable         = CellularSrcTokenSuccessTable,
        .cellularSrcTokenSuccessTableSize      = CellularSrcTokenSuccessTableSize,
        .pCellularUrcTokenWoPrefixTable        = CellularUrcTokenWoPrefixTable,
        .cellularUrcTokenWoPrefixTableSize     = CellularUrcTokenWoPrefixTableSize,
        .pCellularSrcExtraTokenSuccessTable    = CellularSrcExtraTokenSuccessTable,
        .cellularSrcExtraTokenSuccessTableSize = CellularSrcExtraTokenSuccessTableSize
    };

    cellularStatus = Cellular_CommonInit(pCellularHandle, pCommInterface, &cellularTokenTable);

