renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
    return cellularStatus;
}

/* Implementation of Cellular_GetSimCardStatus */
CellularError_t Cellular_GetSimCardStatus (CellularHandle_t cellularHandle, CellularSimCardStatus_t * pSimCardStatus)
{
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularContext_t * pContext       = (CellularContext_t *) cellularHandle;
    BaseType_t          semaphore_ret  = 0;

    /* pContext is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(pContext);

    if (cellularStatus != CELLULAR_SUCCESS)
    {
        LogDebug(("Cellular_GetSimCardStatus : _Cellular_CheckLibraryStatus failed"));
    }
    else if (pSimCardStatus == NULL)
    {
        LogWarn(("Cellular_GetSimCardStatus : Bad input Parameter"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);

        /* Parameters are checked in this API. */
        pSimCardStatus->simCardState     = CELLULAR_SIM_CARD_UNKNOWN;
        pSimCardStatus->simCardLockState = CELLULAR_SIM_CARD_LOCK_UNKNOWN;

        cellularStatus = Cellular_CommonGetSimCardLockStatus(cellularHandle, pSimCardStatus);

        if (cellularStatus == CELLULAR_SUCCESS)
        {
            if ((pSimCardStatus->simCardLockState != CELLULAR_SIM_CARD_INVALID) &&
                (pSimCardStatus->simCardLockState != CELLULAR_SIM_CARD_LOCK_UNKNOWN))
            {
                pSimCardStatus->simCardState = CELLULAR_SIM_CARD_INSERTED;
            }
            else
            {
                pSimCardStatus->simCardState = CELLULAR_SIM_CARD_UNKNOWN;
            }
        }
        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_GetSimCardInfo */
CellularError_t Cellular_GetSimCardInfo (CellularHandle_t cellularHandle, CellularSimCardInfo_t * pSimCardInfo)
{
    CellularContext_t * pContext       = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    CellularAtReq_t     atReqGetIccid  = {0};
    CellularAtReq_t     atReqGetImsi   = {0};
    CellularAtReq_t     atReqGetHplmn  = {0};
    BaseType_t          semaphore_ret  = 0;

    atReqGetIccid.pAtCmd       = "AT+SQNCCID?";
    atReqGetIccid.atCmdType    = CELLULAR_AT_WITH_PREFIX;
    atReqGetIccid.pAtRspPrefix = "+SQNCCID";
    atReqGetIccid.respCallback = _Cellular_RecvFuncGetIccid;
    atReqGetIccid.dataLen      = CELLULAR_ICCID_MAX_SIZE + 1U;

    atReqGetImsi.pAtCmd       = "AT+CIMI";
    atReqGetImsi.atCmdType    = CELLULAR_AT_WO_PREFIX;
    atReqGetImsi.pAtRspPrefix = NULL;
    atReqGetImsi.respCallback = _Cellular_RecvFuncGetImsi;
    atReqGetImsi.dataLen      = CELLULAR_IMSI_MAX_SIZE + 1U;

    atReqGetHplmn.pAtCmd       = "AT+CRSM=176,28514,0,0,0"; /* READ BINARY commmand. HPLMN Selector with Access Technology( 6F62 ). */
    atReqGetHplmn.atCmdType    = CELLULAR_AT_WITH_PREFIX;
    atReqGetHplmn.pAtRspPrefix = "+CRSM";
    atReqGetHplmn.respCallback = _Cellular_RecvFuncGetHplmn;
    atReqGetHplmn.dataLen      = (uint16_t)sizeof(CellularPlmnInfo_t);

    /* pContext is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(pContext);

    if (cellularStatus != CELLULAR_SUCCESS)
    {
        LogError(("_Cellular_CheckLibraryStatus failed"));
    }
    else if (pSimCardInfo == NULL)
    {
        LogError(("Cellular_GetSimCardInfo : Bad parameter"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        atReqGetIccid.pData        = pSimCardInfo->iccid;
        atReqGetImsi.pData        = pSimCardInfo->imsi;
        atReqGetHplmn.pData        = &pSimCardInfo->plmn;

        semaphore_ret = aws_cellular_rts_deactive(pContext);

        (void) memset(pSimCardInfo, 0, sizeof(CellularSimCardInfo_t));
        pktStatus = _Cellular_AtcmdRequestWithCallback(pContext, atReqGetImsi);

        if (pktStatus == CELLULAR_PKT_STATUS_OK)
        {
            pktStatus = _Cellular_AtcmdRequestWithCallback(pContext, atReqGetHplmn);
        }

        if (pktStatus == CELLULAR_PKT_STATUS_OK)
        {
            pktStatus = _Cellular_AtcmdRequestWithCallback(pContext, atReqGetIccid);
        }

        if (pktStatus != CELLULAR_PKT_STATUS_OK)
        {
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }
        else
        {
            LogDebug(("SimInfo updated: IMSI:%s, Hplmn:%s%s, ICCID:%s",
                      pSimCardInfo->imsi, pSimCardInfo->plmn.mcc, pSimCardInfo->plmn.mnc,
                      pSimCardInfo->iccid));
        }
        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_GetPdnStatus */
CellularError_t Cellular_GetPdnStatus (CellularHandle_t      cellularHandle,
                                       CellularPdnStatus_t * pPdnStatusBuffers,
                                       uint8_t               numStatusBuffers,
                                       uint8_t             * pNumStatus)
{
    CellularContext_t         * pContext           = (CellularContext_t *) cellularHandle;
    CellularError_t             cellularStatus     = CELLULAR_SUCCESS;
    CellularPktStatus_t         pktStatus          = CELLULAR_PKT_STATUS_OK;
    CellularPdnContextActInfo_t pdpContextsActInfo = {0};
    CellularPdnContextInfo_t    pdpContextsInfo    = {0};
    BaseType_t                  semaphore_ret      = 0;

        /* Make sure the library is open. */
        cellularStatus = _Cellular_CheckLibraryStatus(pContext);

    if ((pPdnStatusBuffers == NULL) || (pNumStatus == NULL) || (numStatusBuffers < 1))
    {
        cellularStatus = CELLULAR_BAD_PARAMETER;
        LogWarn(("_Cellular_GetPdnStatus: Bad input Parameter "));
    }

    if (cellularStatus == CELLULAR_SUCCESS)
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);

        *pNumStatus = 0;

