renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        /* Check the current <Act> status of contexts. */
        cellularStatus = _Cellular_GetContextActivationStatus(cellularHandle, &pdpContextsActInfo);

        if (cellularStatus == CELLULAR_SUCCESS)
        {
            /* Get PDP config info */
            CellularAtReq_t atReqGetCurrentApnName =
            {
                "AT+CGDCONT?",
                CELLULAR_AT_MULTI_WITH_PREFIX,
                "+CGDCONT",
                _Cellular_RecvFuncGetPdpContextSettings,
                &pdpContextsInfo,
                sizeof(CellularPdnContextInfo_t),
            };

            pktStatus      = _Cellular_AtcmdRequestWithCallback(pContext, atReqGetCurrentApnName);
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);

            if (cellularStatus == CELLULAR_SUCCESS)
            {
                /* WAIT_LOOP */
                for (uint8_t i = 0; i < RM_CELLULAR_RYZ_MAX_PDP_CONTEXTS; i++)
                {
                    if (*pNumStatus == numStatusBuffers)
                    {
                        /* stop if the number of status buffers has been filled */
                        break;
                    }

                    if (pdpContextsInfo.contextsPresent[i] && pdpContextsActInfo.contextsPresent[i])
                    {
                        /* Set CID */
                        pPdnStatusBuffers[i].contextId = (uint8_t) (i + 1);

                        /* Get IP Address */
                        aws_cellular_rts_active(pContext, semaphore_ret);
                        cellularStatus = Cellular_GetIPAddress(cellularHandle,
                                                               (uint8_t) (i + 1),
                                                               pPdnStatusBuffers[i].ipAddress.ipAddress,
                                                               CELLULAR_IP_ADDRESS_MAX_SIZE + 1);
                        semaphore_ret = aws_cellular_rts_deactive(pContext);
                        if (cellularStatus != CELLULAR_SUCCESS)
                        {
                            break;
                        }

                        /* Set IP type */
                        if (0 == strcmp(pdpContextsInfo.ipType[i], "IPV4"))
                        {
                            pPdnStatusBuffers[i].ipAddress.ipAddressType = CELLULAR_IP_ADDRESS_V4;
                            pPdnStatusBuffers[i].pdnContextType          = CELLULAR_PDN_CONTEXT_IPV4;
                        }
                        else if (0 == strcmp(pdpContextsInfo.ipType[i], "IPV6"))
                        {
                            pPdnStatusBuffers[i].ipAddress.ipAddressType = CELLULAR_IP_ADDRESS_V6;
                            pPdnStatusBuffers[i].pdnContextType          = CELLULAR_PDN_CONTEXT_IPV6;
                        }
                        else
                        {
                            pPdnStatusBuffers[i].ipAddress.ipAddressType = CELLULAR_IP_ADDRESS_V4;
                            pPdnStatusBuffers[i].pdnContextType          = CELLULAR_PDN_CONTEXT_IPV4V6;
                        }

                        /* Set activation state */
                        LogDebug(("Context [%d], Act State [%d]\r\n", i + 1,
                                  pdpContextsActInfo.contextActState[i]));
                        pPdnStatusBuffers[i].state = pdpContextsActInfo.contextActState[i];

                        (*pNumStatus)++;
                    }
                }
            }
        }

        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_ActivatePdn */
CellularError_t Cellular_ActivatePdn (CellularHandle_t cellularHandle, uint8_t contextId)
{
    CellularContext_t * pContext       = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    char                cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};
    BaseType_t          semaphore_ret  = 0;

    CellularPdnContextActInfo_t pdpContextsActInfo = {0};

    CellularAtReq_t atReqActPdn =
    {
        cmdBuf,
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    cellularStatus = _Cellular_IsValidPdn(contextId);

    if (cellularStatus == CELLULAR_SUCCESS)
    {
        /* Make sure the library is open. */
        cellularStatus = _Cellular_CheckLibraryStatus(pContext);
    }

    if (cellularStatus == CELLULAR_SUCCESS)
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);

        /* Check the current <Act> status of context. If not activated, activate the PDN context ID. */
        cellularStatus = _Cellular_GetContextActivationStatus(cellularHandle, &pdpContextsActInfo);

        if (cellularStatus == CELLULAR_SUCCESS)
        {
            /* Activate context if not already active */
            if (pdpContextsActInfo.contextActState[contextId - 1] == false)
            {
                (void) snprintf(cmdBuf, sizeof(cmdBuf), "%s=1,%u", "AT+CGACT", contextId);
                pktStatus = _Cellular_TimeoutAtcmdRequestWithCallback(pContext,
                                                                      atReqActPdn,
                                                                      RM_CELLULAR_RYZ_PDN_ACT_PACKET_REQ_TIMEOUT_MS);

                if (pktStatus != CELLULAR_PKT_STATUS_OK)
                {
                    LogError(("Cellular_ActivatePdn: can't activate PDN, PktRet: %d", pktStatus));
                    cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
                }
            }
            else
            {
                LogInfo(("Cellular_ActivatePdn: Context id [%d] is already active", contextId));
            }
        }
        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_DeactivatePdn */
CellularError_t Cellular_DeactivatePdn (CellularHandle_t cellularHandle, uint8_t contextId)
{
    CellularContext_t * pContext       = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    char                cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};
    bool                packetSwitchStatus               = false;
    BaseType_t          semaphore_ret  = 0;

