renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
    CellularServiceStatus_t     serviceStatus;
    CellularPdnContextActInfo_t pdpContextsActInfo = {0};

    CellularAtReq_t atReqDeactPdn =
    {
        cmdBuf,
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    memset(&serviceStatus, 0, sizeof(serviceStatus));

    cellularStatus = _Cellular_IsValidPdn(contextId);

    if (cellularStatus == CELLULAR_SUCCESS)
    {
        /* Make sure the library is open. */
        cellularStatus = _Cellular_CheckLibraryStatus(pContext);
    }

    if (cellularStatus == CELLULAR_SUCCESS)
    {
        /* Get current network operator settings. */
        cellularStatus = Cellular_GetServiceStatus(cellularHandle, &serviceStatus);

        semaphore_ret = aws_cellular_rts_deactive(pContext);

        if (cellularStatus == CELLULAR_SUCCESS)
        {
            /* Check the current <Act> status of context. */
            cellularStatus = _Cellular_GetContextActivationStatus(cellularHandle, &pdpContextsActInfo);
        }

        if (cellularStatus == CELLULAR_SUCCESS)
        {
            LogDebug(("Cellular_DeactivatePdn: Listing operator and context details below."));

            /* Deactivate context if active */
            if (pdpContextsActInfo.contextActState[contextId - 1] == true)
            {
                /* Don't deactivate LTE default bearer context */
                /* Otherwise sending AT command "+CGACT=0,1" for deactivation will result in ERROR */
                if ((serviceStatus.rat >= CELLULAR_RAT_LTE) && (contextId == RM_CELLULAR_RYZ_DEFAULT_BEARER_CONTEXT_ID))
                {
                    LogInfo(("Cellular_DeactivatePdn: Default Bearer context %d Active. Not allowed to deactivate.",
                             contextId));
                    cellularStatus = CELLULAR_NOT_ALLOWED;
                }
                else
                {
                    (void) snprintf(cmdBuf, sizeof(cmdBuf), "%s=0,%u", "AT+CGACT", contextId);
                    pktStatus = _Cellular_TimeoutAtcmdRequestWithCallback(pContext,
                                                                          atReqDeactPdn,
                                                                          RM_CELLULAR_RYZ_PDN_DEACT_PACKET_REQ_TIMEOUT_MS);
                    cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
                }

                if ((cellularStatus != CELLULAR_SUCCESS) && (cellularStatus != CELLULAR_NOT_ALLOWED))
                {
                    LogError(("Cellular_DeactivatePdn: can't deactivate PDN, PktRet: %d", pktStatus));

                    /* Sometimes +CGACT deactivation fails in 2G. Then check packet switch attach. If attached, detach packet switch. */
                    if ((serviceStatus.rat == CELLULAR_RAT_GSM) || (serviceStatus.rat == CELLULAR_RAT_EDGE))
                    {
                        cellularStatus = _Cellular_GetPacketSwitchStatus(cellularHandle, &packetSwitchStatus);

                        if ((cellularStatus == CELLULAR_SUCCESS) && (packetSwitchStatus == true))
                        {
                            LogError(("Deactivate Packet switch"));
                            (void) snprintf(cmdBuf, sizeof(cmdBuf), "%s", "AT+CGATT=0");
                            pktStatus = _Cellular_TimeoutAtcmdRequestWithCallback(pContext,
                                                                                  atReqDeactPdn,
                                                                                  RM_CELLULAR_RYZ_GPRS_ATTACH_REQ_TIMEOUT_MS);
                            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
                        }
                        else if (cellularStatus != CELLULAR_SUCCESS)
                        {
                            LogError(("Packet switch query failed"));
                            pktStatus      = CELLULAR_PKT_STATUS_FAILURE;
                            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
                        }
                        else
                        {
                            LogInfo(("Packet switch detached"));
                        }
                    }
                }
            }
            else
            {
                LogInfo(("Cellular_DeactivatePdn: Context id [%d] is already deactive", contextId));
            }
        }
        else
        {
            LogError(("Cellular_DeactivatePdn: Unable to list operator and context details."));
        }

        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_GetSignalInfo */
CellularError_t Cellular_GetSignalInfo (CellularHandle_t cellularHandle, CellularSignalInfo_t * pSignalInfo)
{
    CellularContext_t * pContext             = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus       = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus            = CELLULAR_PKT_STATUS_OK;
    CellularRat_t       rat                  = CELLULAR_RAT_INVALID;
    BaseType_t          semaphore_ret        = 0;
    CellularAtReq_t     atReqQuerySignalInfo =
    {
        "AT+CSQ",
        CELLULAR_AT_WITH_PREFIX,
        "+CSQ",
        _Cellular_RecvFuncGetSignalInfo,
        pSignalInfo,
        sizeof(CellularSignalInfo_t),
    };
    CellularAtReq_t atReqQueryExtendedSignalInfo =
    {
        "AT+CESQ",
        CELLULAR_AT_WITH_PREFIX,
        "+CESQ",
        _Cellular_RecvFuncGetSignalInfo,
        pSignalInfo,
        sizeof(CellularSignalInfo_t),
    };

    cellularStatus = _Cellular_CheckLibraryStatus(pContext);

    if (cellularStatus != CELLULAR_SUCCESS)
    {
        LogDebug(("Cellular_GetSignalInfo: _Cellular_CheckLibraryStatus failed"));
    }
    else if (pSignalInfo == NULL)
    {
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        cellularStatus = _Cellular_GetCurrentRat(pContext, &rat);
    }

    if (cellularStatus == CELLULAR_SUCCESS)
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);

        /* Get +CSQ response */
        pktStatus = _Cellular_AtcmdRequestWithCallback(pContext, atReqQuerySignalInfo);

        if (pktStatus == CELLULAR_PKT_STATUS_OK)
        {
            /* Get +CESQ response */
            pktStatus = _Cellular_AtcmdRequestWithCallback(pContext, atReqQueryExtendedSignalInfo);

            if (pktStatus == CELLULAR_PKT_STATUS_OK)
            {
                /* If the convert failed, the API will return CELLULAR_INVALID_SIGNAL_BAR_VALUE in bars field. */
                (void) _Cellular_ComputeSignalBars(rat, pSignalInfo);
            }

            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(pContext, semaphore_ret);
    }

