renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
    return cellularStatus;
}

/* Implementation of Cellular_GetHostByName */
CellularError_t Cellular_GetHostByName (CellularHandle_t cellularHandle,
                                        uint8_t          contextId,
                                        const char     * pcHostName,
                                        char           * pResolvedAddress)
{
    CellularContext_t * pContext       = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    char                cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};
    BaseType_t          semaphore_ret  = 0;

    CellularAtReq_t atReqQueryDns =
    {
        cmdBuf,
        CELLULAR_AT_MULTI_WITH_PREFIX,
        "+SQNDNSLKUP",
        _Cellular_RecvFuncResolveDomainToIpAddress,
        pResolvedAddress,
        CELLULAR_IP_ADDRESS_MAX_SIZE,
    };

    (void)(contextId);

    /* pContext is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(pContext);

    if (cellularStatus != CELLULAR_SUCCESS)
    {
        LogDebug(("Cellular_GetHostByName: _Cellular_CheckLibraryStatus failed"));
    }
    else
    {
        if ((pcHostName == NULL) || (pResolvedAddress == NULL))
        {
            LogError(("Cellular_GetHostByName: Bad input Parameter "));
            cellularStatus = CELLULAR_BAD_PARAMETER;
        }
    }

    if (cellularStatus == CELLULAR_SUCCESS)
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);
        
        (void) snprintf(cmdBuf, sizeof(cmdBuf), "AT+SQNDNSLKUP=\"%s\"", pcHostName);

        pktStatus = _Cellular_TimeoutAtcmdRequestWithCallback(pContext,
                                                              atReqQueryDns,
                                                              RM_CELLULAR_RYZ_DNS_QUERY_REQ_TIMEOUT_MS);

        if (pktStatus != CELLULAR_PKT_STATUS_OK)
        {
            LogError(("Cellular_GetHostByName: couldn't resolve host name"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_SocketConnect */
CellularError_t Cellular_SocketConnect (CellularHandle_t                cellularHandle,
                                        CellularSocketHandle_t          socketHandle,
                                        CellularSocketAccessMode_t      dataAccessMode,
                                        const CellularSocketAddress_t * pRemoteSocketAddress)
{
    CellularContext_t * pContext       = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    char                cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};
    BaseType_t          semaphore_ret  = 0;

    CellularAtReq_t     atReqSocketConnect               =
    {
        cmdBuf,
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };
    CellularSocketOpenCallback_t openCallback = NULL;

    /* Make sure the library is open. */
    cellularStatus = _Cellular_CheckLibraryStatus(pContext);

    if (cellularStatus != CELLULAR_SUCCESS)
    {
        LogDebug(("Cellular_SocketConnect: _Cellular_CheckLibraryStatus failed"));
    }
    else if (pRemoteSocketAddress == NULL)
    {
        LogDebug(("Cellular_SocketConnect: Invalid socket address"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else if (socketHandle == NULL)
    {
        LogDebug(("Cellular_SocketConnect: Invalid socket handle"));
        cellularStatus = CELLULAR_INVALID_HANDLE;
    }
    else
    {
        if (socketHandle->socketState != SOCKETSTATE_ALLOCATED)
        {
            LogError(("storeAccessModeAndAddress, bad socket state %d",
                      socketHandle->socketState));
            cellularStatus = CELLULAR_INTERNAL_FAILURE;
        }
        else if (dataAccessMode != CELLULAR_ACCESSMODE_BUFFER)
        {
            LogError(("storeAccessModeAndAddress, Access mode not supported %d",
                      dataAccessMode));
            cellularStatus = CELLULAR_UNSUPPORTED;
        }
        else
        {
            socketHandle->remoteSocketAddress.port = pRemoteSocketAddress->port;
            socketHandle->dataMode                 = dataAccessMode;
            socketHandle->remoteSocketAddress.ipAddress.ipAddressType =
                pRemoteSocketAddress->ipAddress.ipAddressType;
            (void) strncpy(socketHandle->remoteSocketAddress.ipAddress.ipAddress,
                           pRemoteSocketAddress->ipAddress.ipAddress,
                           CELLULAR_IP_ADDRESS_MAX_SIZE + 1U);

            if (socketHandle->openCallback != NULL)
            {
                openCallback = socketHandle->openCallback;
            }
        }
    }

    /* Configure the socket. */
    if (cellularStatus == CELLULAR_SUCCESS)
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);

        /* AT+SQNSCFG=<connId>,<cid>,<pktSz>,<maxTo(1s)>,<connTo(0.1s)>,<txTo(0.1s)>*/
        snprintf(cmdBuf, sizeof(cmdBuf), "AT+SQNSCFG=%u,%d,0,90,600,50",
                 RM_CELLULAR_RYZ_GET_MODEM_SOCKET_ID(socketHandle->socketId), socketHandle->contextId);

        pktStatus = _Cellular_TimeoutAtcmdRequestWithCallback(pContext,
                                                              atReqSocketConnect,
                                                              RM_CELLULAR_RYZ_SOCKET_CONNECT_PACKET_REQ_TIMEOUT_MS);

        if (pktStatus == CELLULAR_PKT_STATUS_OK)
        {
            snprintf(cmdBuf, sizeof(cmdBuf), "AT+SQNSCFGEXT=%u,0,0,0",
                     RM_CELLULAR_RYZ_GET_MODEM_SOCKET_ID(socketHandle->socketId));

            pktStatus = _Cellular_TimeoutAtcmdRequestWithCallback(pContext,
                                                                  atReqSocketConnect,
                                                                  RM_CELLULAR_RYZ_SOCKET_CONNECT_PACKET_REQ_TIMEOUT_MS);

            if (pktStatus != CELLULAR_PKT_STATUS_OK)
            {
                LogError(("Cellular_SocketConnect: Socket configure failed, cmdBuf:%s, PktRet: %d", cmdBuf, pktStatus));
                cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
            }
        }
        else
        {
            LogError(("Cellular_SocketConnect: Socket configure failed, cmdBuf:%s, PktRet: %d", cmdBuf, pktStatus));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    /* Start the connection. */
    if (cellularStatus == CELLULAR_SUCCESS)
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);

        uint8_t protocol = (CELLULAR_SOCKET_PROTOCOL_TCP == socketHandle->socketProtocol) ? 0 : 1;

