renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        snprintf(cmdBuf,
                 sizeof(cmdBuf),
                 "AT+SQNSD=%u,%u,%u,\"%s\",0,%d,1,0",
                 RM_CELLULAR_RYZ_GET_MODEM_SOCKET_ID(socketHandle->socketId),
                 protocol,
                 socketHandle->remoteSocketAddress.port,
                 socketHandle->remoteSocketAddress.ipAddress.ipAddress,
                 socketHandle->localPort);

        pktStatus = _Cellular_TimeoutAtcmdRequestWithCallback(pContext,
                                                              atReqSocketConnect,
                                                              RM_CELLULAR_RYZ_SOCKET_CONNECT_PACKET_REQ_TIMEOUT_MS);

        if (pktStatus != CELLULAR_PKT_STATUS_OK)
        {
            LogError(("Cellular_SocketConnect: Socket connect failed, cmdBuf:%s, PktRet: %d", cmdBuf, pktStatus));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }
        else
        {
            socketHandle->socketState = SOCKETSTATE_CONNECTED;
        }

        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    /* Call callback */
    if (openCallback != NULL)
    {
        if (CELLULAR_SUCCESS == cellularStatus)
        {
            openCallback(CELLULAR_URC_SOCKET_OPENED, socketHandle, socketHandle->pOpenCallbackContext);
        }
        else
        {
            openCallback(CELLULAR_URC_SOCKET_OPEN_FAILED, socketHandle, socketHandle->pOpenCallbackContext);
        }
    }

    return cellularStatus;
}

/* Implementation of Cellular_SocketSend */
CellularError_t Cellular_SocketSend (CellularHandle_t       cellularHandle,
                                     CellularSocketHandle_t socketHandle,
                                     const uint8_t        * pData,
                                     uint32_t               dataLength,
                                     uint32_t             * pSentDataLength)
{
    CellularContext_t * pContext       = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    uint32_t            sendTimeout    = RM_CELLULAR_RYZ_DATA_SEND_TIMEOUT_MS;
    char                cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};
    BaseType_t          semaphore_ret  = 0;

    CellularAtReq_t     atReqSocketSend =
    {
        cmdBuf,
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    CellularAtDataReq_t atDataReqSocketSend =
    {
        pData,
        dataLength,
        pSentDataLength,
        NULL,
        0
    };

    /* pContext is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(pContext);

    if (cellularStatus != CELLULAR_SUCCESS)
    {
        LogDebug(("Cellular_SocketSend: _Cellular_CheckLibraryStatus failed"));
    }
    else if (socketHandle == NULL)
    {
        cellularStatus = CELLULAR_INVALID_HANDLE;
    }
    else if ((pData == NULL) || (pSentDataLength == NULL) || (dataLength == 0U))
    {
        LogDebug(("Cellular_SocketSend: Invalid parameter"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else if (socketHandle->socketState != SOCKETSTATE_CONNECTED)
    {
        /* Check the socket connection state. */
        if ((socketHandle->socketState == SOCKETSTATE_ALLOCATED) ||
            (socketHandle->socketState == SOCKETSTATE_CONNECTING))
        {
            cellularStatus = CELLULAR_SOCKET_NOT_CONNECTED;
        }
        else
        {
            cellularStatus = CELLULAR_SOCKET_CLOSED;
        }
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);

        /* Send data length check. */
        if (dataLength > (uint32_t) CELLULAR_MAX_SEND_DATA_LEN)
        {
            atDataReqSocketSend.dataLen = (uint32_t) CELLULAR_MAX_SEND_DATA_LEN;
        }

        /* Check send timeout. If not set by setsockopt, use default value. */
        if (socketHandle->sendTimeoutMs != 0U)
        {
            sendTimeout = socketHandle->sendTimeoutMs;
        }

        snprintf(cmdBuf, sizeof(cmdBuf), "AT+SQNSSENDEXT=%u,%u",
                 RM_CELLULAR_RYZ_GET_MODEM_SOCKET_ID(socketHandle->socketId), (uint16_t) atDataReqSocketSend.dataLen);

        pktStatus = _Cellular_AtcmdDataSend(pContext,
                                            atReqSocketSend,
                                            atDataReqSocketSend,
                                            socketSendDataPrefix,
                                            NULL,
                                            RM_CELLULAR_RYZ_PACKET_REQ_TIMEOUT_MS,
                                            sendTimeout,
                                            RM_CELLULAR_RYZ_DATA_SEND_INTER_DELAY_MS);

        if (pktStatus != CELLULAR_PKT_STATUS_OK)
        {
            if (socketHandle->socketState == SOCKETSTATE_DISCONNECTED)
            {
                LogInfo(("Cellular_SocketSend: Data send fail, socket already closed"));
                cellularStatus = CELLULAR_SOCKET_CLOSED;
            }
            else
            {
                LogError(("Cellular_SocketSend: Data send fail, PktRet: %d", pktStatus));
                cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
            }
        }

        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_SocketRecv */
CellularError_t Cellular_SocketRecv (CellularHandle_t       cellularHandle,
                                     CellularSocketHandle_t socketHandle,
                                     uint8_t              * pBuffer,
                                     uint32_t               bufferLength,
                                     uint32_t             * pReceivedDataLength)
{
    CellularContext_t * pContext       = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    char                cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};
    uint32_t            recvTimeout     = RM_CELLULAR_RYZ_DATA_READ_TIMEOUT_MS;
    uint32_t            recvLen         = bufferLength;
    _socketDataRecv_t   dataRecv        = {0};
    BaseType_t          semaphore_ret   = 0;
    CellularAtReq_t     atReqSocketRecv =
    {
        cmdBuf,
        CELLULAR_AT_MULTI_DATA_WO_PREFIX,
        "+SQNSRECV",
        _Cellular_RecvFuncData,
        (void *) &dataRecv,
        (uint16_t) bufferLength,
    };

    cellularStatus = _Cellular_CheckLibraryStatus(pContext);

    if (cellularStatus != CELLULAR_SUCCESS)
    {
        LogDebug(("Cellular_SocketRecv: _Cellular_CheckLibraryStatus failed"));
    }
    else if (socketHandle == NULL)
    {
        cellularStatus = CELLULAR_INVALID_HANDLE;
    }
    else if ((pBuffer == NULL) || (pReceivedDataLength == NULL) || (bufferLength == 0U))
    {
        LogDebug(("Cellular_SocketRecv: Bad input Param"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);

        dataRecv.pDataLen = pReceivedDataLength;
        dataRecv.pData    = pBuffer;

