renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        /* Update recvLen to maximum module length. */
        if (CELLULAR_MAX_RECV_DATA_LEN <= bufferLength)
        {
            recvLen = (uint32_t) CELLULAR_MAX_RECV_DATA_LEN;
        }

        if (recvLen > 0)
        {
            /* Update receive timeout to default timeout if not set with setsocketopt. */
            if (socketHandle->recvTimeoutMs > 1U)
            {
                recvTimeout = socketHandle->recvTimeoutMs;
            }

            snprintf(cmdBuf, sizeof(cmdBuf), "AT+SQNSRECV=%u,%u",
                     RM_CELLULAR_RYZ_GET_MODEM_SOCKET_ID(socketHandle->socketId), (uint16_t) recvLen);
            pktStatus = _Cellular_TimeoutAtcmdDataRecvRequestWithCallback(pContext,
                                                                          atReqSocketRecv,
                                                                          recvTimeout,
                                                                          socketRecvDataPrefix,
                                                                          NULL);

            if (pktStatus != CELLULAR_PKT_STATUS_OK)
            {
                /* Reset data handling parameters. */
                LogError(("Cellular_SocketRecv: Data Receive fail, pktStatus: %d", pktStatus));
                cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
            }
        }

        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_SocketClose */
CellularError_t Cellular_SocketClose (CellularHandle_t cellularHandle, CellularSocketHandle_t socketHandle)
{
    CellularContext_t * pContext       = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    char                cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};
    BaseType_t          semaphore_ret  = 0;
    CellularAtReq_t     atReqSockClose =
    {
        cmdBuf,
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* Make sure the library is open. */
    cellularStatus = _Cellular_CheckLibraryStatus(pContext);

    if (cellularStatus != CELLULAR_SUCCESS)
    {
        LogDebug(("_Cellular_CheckLibraryStatus failed"));
    }
    else if (socketHandle == NULL)
    {
        cellularStatus = CELLULAR_INVALID_HANDLE;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);

        if ((socketHandle->socketState == SOCKETSTATE_CONNECTING) ||
            (socketHandle->socketState == SOCKETSTATE_CONNECTED) ||
            (socketHandle->socketState == SOCKETSTATE_DISCONNECTED))
        {
            /* Form the AT command. */
            snprintf(cmdBuf, sizeof(cmdBuf), "AT+SQNSH=%u",
                     RM_CELLULAR_RYZ_GET_MODEM_SOCKET_ID(socketHandle->socketId));
            pktStatus = _Cellular_TimeoutAtcmdRequestWithCallback(pContext,
                                                                  atReqSockClose,
                                                                  RM_CELLULAR_RYZ_SOCKET_DISCONNECT_PACKET_REQ_TIMEOUT_MS);

            if (pktStatus != CELLULAR_PKT_STATUS_OK)
            {
                LogError(("Cellular_SocketClose: Socket close failed, cmdBuf:%s, PktRet: %d", cmdBuf, pktStatus));
            }
        }

        /* Ignore the result from the info, and force to remove the socket. */
        cellularStatus = _Cellular_RemoveSocketData(pContext, socketHandle);

        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_GetServiceStatus */
CellularError_t Cellular_GetServiceStatus (CellularHandle_t cellularHandle, CellularServiceStatus_t * pServiceStatus)
{
    CellularContext_t     * pContext       = (CellularContext_t *) cellularHandle;
    CellularError_t         cellularStatus = CELLULAR_SUCCESS;
    CellularServiceStatus_t serviceStatus;
    BaseType_t              semaphore_ret  = 0;

    (void) memset(&serviceStatus, 0, sizeof(CellularServiceStatus_t));

    /* pContext is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(pContext);

    if (cellularStatus != CELLULAR_SUCCESS)
    {
        LogError(("_Cellular_CheckLibraryStatus failed"));
    }
    else if (pServiceStatus == NULL)
    {
        LogError(("Cellular_GetServiceStatus : Bad parameter"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);

        const cellularAtData_t * pLibAtData     = NULL;
        CellularPktStatus_t      pktStatus      = CELLULAR_PKT_STATUS_OK;
        CellularAtReq_t          atReqCommon = {0};

        atReqCommon.pAtCmd       = "AT+CEREG?";
        atReqCommon.atCmdType    = CELLULAR_AT_MULTI_WITH_PREFIX;
        atReqCommon.pAtRspPrefix = "+CEREG";
        atReqCommon.respCallback = _Cellular_RecvFuncGetNetworkReg;
        atReqCommon.pData        = NULL;
        atReqCommon.dataLen      = 0;

        pktStatus      = _Cellular_AtcmdRequestWithCallback(pContext, atReqCommon);
        cellularStatus = _Cellular_TranslatePktStatus(pktStatus);

        /* Get the service status from lib AT data. */
        if (cellularStatus == CELLULAR_SUCCESS)
        {
            pLibAtData = &pContext->libAtData;
            _Cellular_LockAtDataMutex(pContext);
            pServiceStatus->rat = pLibAtData->rat;
            pServiceStatus->csRegistrationStatus = pLibAtData->csRegStatus;
            pServiceStatus->psRegistrationStatus = pLibAtData->psRegStatus;
            pServiceStatus->csRejectionCause     = pLibAtData->csRejCause;
            pServiceStatus->csRejectionType      = pLibAtData->csRejectType;
            pServiceStatus->psRejectionCause     = pLibAtData->psRejCause;
            pServiceStatus->psRejectionType      = pLibAtData->psRejectType;
            _Cellular_UnlockAtDataMutex(pContext);

            atReqCommon.pAtCmd       = "AT+COPS?";
            atReqCommon.atCmdType    = CELLULAR_AT_WITH_PREFIX;
            atReqCommon.pAtRspPrefix = "+COPS";
            atReqCommon.respCallback = _Cellular_RecvFuncUpdateMccMnc;
            atReqCommon.pData        = &serviceStatus;
            atReqCommon.dataLen      = (uint16_t) sizeof(CellularServiceStatus_t);

            pktStatus      = _Cellular_AtcmdRequestWithCallback(pContext, atReqCommon);
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);

