renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
            if (cellularStatus == CELLULAR_SUCCESS)
            {
                /* Service status data from operator info. */
                pServiceStatus->networkRegistrationMode = serviceStatus.networkRegistrationMode;
                pServiceStatus->plmnInfo                = serviceStatus.plmnInfo;
                (void) strncpy(pServiceStatus->operatorName, serviceStatus.operatorName, sizeof(serviceStatus.operatorName));
                pServiceStatus->operatorNameFormat = serviceStatus.operatorNameFormat;

                LogDebug(("SrvStatus: rat %d cs %d, ps %d, mode %d, csRejType %d,",
                          pServiceStatus->rat,
                          pServiceStatus->csRegistrationStatus,
                          pServiceStatus->psRegistrationStatus,
                          pServiceStatus->networkRegistrationMode,
                          pServiceStatus->csRejectionType));

                LogDebug(("csRej %d, psRejType %d, psRej %d, plmn %s%s",
                          pServiceStatus->csRejectionCause,
                          pServiceStatus->psRejectionType,
                          pServiceStatus->psRejectionCause,
                          pServiceStatus->plmnInfo.mcc,
                          pServiceStatus->plmnInfo.mnc));
            }
        }

        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    return cellularStatus;
}

/*******************************************************************************************************************//**
 * Callback to process AT+CEREG response.
 *
 * @param[in] pContext  Pointer to cellular context.
 * @param[in] pAtResp   Pointer to AT command response.
 * @param[in] pData     Pointer to where to store parsed data.
 * @param[in] dataLen   Length of where to store parsed data.
 *
 * @retval  CELLULAR_PKT_STATUS_OK          Response processing succeeded
 * @retval  CELLULAR_PKT_STATUS_FAILURE     Parsing failure
 * @retval  CELLULAR_PKT_STATUS_BAD_PARAM   Bad parameter passed to callback
 **********************************************************************************************************************/
static CellularPktStatus_t _Cellular_RecvFuncGetNetworkReg (CellularContext_t                 * pContext,
                                                            const CellularATCommandResponse_t * pAtResp,
                                                            void                              * pData,
                                                            uint16_t                            dataLen)
{
    char              * pPregLine    = NULL;
    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus = CELLULAR_AT_SUCCESS;

    (void)(pData);
    (void)(dataLen);

    if (pContext == NULL)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((pAtResp == NULL) || (pAtResp->pItm == NULL) || (pAtResp->pItm->pLine == NULL))
    {
        LogError(("_Cellular_RecvFuncGetNetworkReg: response is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else
    {
        pPregLine    = pAtResp->pItm->pLine;
        atCoreStatus = Cellular_ATRemoveLeadingWhiteSpaces(&pPregLine);
        pktStatus    = _Cellular_TranslateAtCoreStatus(atCoreStatus);

        if (pktStatus == CELLULAR_PKT_STATUS_OK)
        {
            /* Assumption is that the data is null terminated so we don't need the dataLen. */
            _Cellular_LockAtDataMutex(pContext);
            pktStatus = _Cellular_ParseRegStatus(pContext, pPregLine, false, CELLULAR_REG_TYPE_CEREG);
            pContext->libAtData.csRegStatus = pContext->libAtData.psRegStatus;
            _Cellular_UnlockAtDataMutex(pContext);
        }

        LogDebug(("atcmd network register status pktStatus:%d", pktStatus));
    }

    return pktStatus;
}

/*******************************************************************************************************************//**
 * Callback to process AT+COPS response.
 *
 * @param[in] pContext  Pointer to cellular context.
 * @param[in] pAtResp   Pointer to AT command response.
 * @param[in] pData     Pointer to where to store parsed data.
 * @param[in] dataLen   Length of where to store parsed data.
 *
 * @retval  CELLULAR_PKT_STATUS_OK          Response processing succeeded
 * @retval  CELLULAR_PKT_STATUS_FAILURE     Parsing failure
 * @retval  CELLULAR_PKT_STATUS_BAD_PARAM   Bad parameter passed to callback
 **********************************************************************************************************************/
static CellularPktStatus_t _Cellular_RecvFuncUpdateMccMnc (CellularContext_t                 * pContext,
                                                           const CellularATCommandResponse_t * pAtResp,
                                                           void                              * pData,
                                                           uint16_t                            dataLen)
{
    char                   * pCopsResponse = NULL;
    CellularPktStatus_t      pktStatus     = CELLULAR_PKT_STATUS_OK;
    CellularATError_t        atCoreStatus  = CELLULAR_AT_SUCCESS;
    CellularServiceStatus_t * pserviceStatus = NULL;

    if (pContext == NULL)
    {
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else if ((pAtResp == NULL) || (pAtResp->pItm == NULL) || (pAtResp->pItm->pLine == NULL))
    {
        LogError(("UpdateMccMnc: Response is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else if ((pData == NULL) || (dataLen != sizeof(CellularServiceStatus_t)))
    {
        LogError(("UpdateMccMnc: pData is invalid or dataLen is wrong"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        pCopsResponse = pAtResp->pItm->pLine;
        pserviceStatus = (CellularServiceStatus_t *) pData;

        /* Remove COPS Prefix. */
        atCoreStatus = Cellular_ATRemovePrefix(&pCopsResponse);

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /* Removing all the Quotes from the COPS response. */
            atCoreStatus = Cellular_ATRemoveAllDoubleQuote(pCopsResponse);
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /* Removing all Space from the COPS response. */
            atCoreStatus = Cellular_ATRemoveAllWhiteSpaces(pCopsResponse);
        }

        /* parse all the data from cops. */
        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            char * pToken            = NULL;
            char * pTempCopsResponse = pCopsResponse;
            bool   parseStatus       = true;

            /* Getting next token from COPS response. */
            atCoreStatus = Cellular_ATGetNextTok(&pTempCopsResponse, &pToken);

            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                int32_t var = 0;

