renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
                atCoreStatus = Cellular_ATStrtoi(pToken, 10, &var);

                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                {
                    if ((var >= 0) && (var < (int32_t) REGISTRATION_MODE_MAX))
                    {
                        /* Variable "var" is ensured that it is valid and within
                         * a valid range. Hence, assigning the value of the variable to
                         * networkRegMode with a enum cast. */

                        /* coverity[misra_c_2012_rule_10_5_violation] */
                        pserviceStatus->networkRegistrationMode = (CellularNetworkRegistrationMode_t) var;
                    }
                    else
                    {
                        LogError(("_parseCopsRegMode: Error in processing Network Registration mode. Token %s",
                                  pToken));
                        parseStatus = false;
                    }
                }

                if (parseStatus == false)
                {
                    atCoreStatus = CELLULAR_AT_ERROR;
                }
            }

            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                atCoreStatus = Cellular_ATGetNextTok(&pTempCopsResponse, &pToken);
            }

            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                int32_t var = 0;

                atCoreStatus = Cellular_ATStrtoi(pToken, 10, &var);

                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                {
                    if ((var >= 0) &&
                        (var < (int32_t) OPERATOR_NAME_FORMAT_MAX))
                    {
                        /* Variable "var" is ensured that it is valid and within
                         * a valid range. Hence, assigning the value of the variable to
                         * operatorNameFormat with a enum cast. */

                        /* coverity[misra_c_2012_rule_10_5_violation] */
                        pserviceStatus->operatorNameFormat = (CellularOperatorNameFormat_t) var;
                    }
                    else
                    {
                        LogError((
                                     "_parseCopsNetworkNameFormat: Error in processing Network Registration mode. Token %s",
                                     pToken));
                        parseStatus = false;
                    }
                }

                if (parseStatus == false)
                {
                    atCoreStatus = CELLULAR_AT_ERROR;
                }
            }

            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                atCoreStatus = Cellular_ATGetNextTok(&pTempCopsResponse, &pToken);
            }

            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                uint32_t mccMncLen = 0U;

                if ((pserviceStatus->operatorNameFormat == OPERATOR_NAME_FORMAT_LONG) ||
                    (pserviceStatus->operatorNameFormat == OPERATOR_NAME_FORMAT_SHORT))
                {
                    (void) strncpy(pserviceStatus->operatorName, pToken, CELLULAR_NETWORK_NAME_MAX_SIZE);
                }
                else if (pserviceStatus->operatorNameFormat == OPERATOR_NAME_FORMAT_NUMERIC)
                {
                    mccMncLen = (uint32_t) strlen(pToken);

                    if ((mccMncLen == (CELLULAR_MCC_MAX_SIZE + CELLULAR_MNC_MAX_SIZE)) ||
                        (mccMncLen == (CELLULAR_MCC_MAX_SIZE + CELLULAR_MNC_MAX_SIZE - 1U)))
                    {
                        (void) strncpy(pserviceStatus->plmnInfo.mcc, pToken, CELLULAR_MCC_MAX_SIZE);
                        pserviceStatus->plmnInfo.mcc[CELLULAR_MCC_MAX_SIZE] = '\0';
                        (void) strncpy(pserviceStatus->plmnInfo.mnc, &pToken[CELLULAR_MCC_MAX_SIZE],
                                       (uint32_t) (mccMncLen - CELLULAR_MCC_MAX_SIZE + 1U));
                        pserviceStatus->plmnInfo.mnc[CELLULAR_MNC_MAX_SIZE] = '\0';
                    }
                    else
                    {
                        LogError(("_parseCopsNetworkName: Error in processing Network MCC MNC: Length not Valid"));
                        parseStatus = false;
                    }
                }
                else
                {
                    LogError(("Error in processing Operator Name: Format Unknown"));
                    parseStatus = false;
                }

                if (parseStatus == false)
                {
                    atCoreStatus = CELLULAR_AT_ERROR;
                }
            }

            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                atCoreStatus = Cellular_ATGetNextTok(&pTempCopsResponse, &pToken);
            }

            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                int32_t var = 0;

                atCoreStatus = Cellular_ATStrtoi(pToken, 10, &var);

                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                {
                    if ((var < (int32_t) CELLULAR_RAT_MAX) && (var >= 0))
                    {
                        /* Variable "var" is ensured that it is valid and within
                         * a valid range. Hence, assigning the value of the variable to
                         * rat with a enum cast. */

                        /* coverity[misra_c_2012_rule_10_5_violation] */
                        pserviceStatus->rat = (CellularRat_t) var;
                    }
                    else
                    {
                        LogError(("_parseCopsNetworkName: Error in processing RAT. Token %s", pToken));
                        parseStatus = false;
                    }
                }

                if (parseStatus == false)
                {
                    atCoreStatus = CELLULAR_AT_ERROR;
                }
            }
        }

        if (atCoreStatus == CELLULAR_AT_ERROR)
        {
            LogError(("ERROR: COPS %s", pCopsResponse));
            pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
        }
    }

    return pktStatus;
}

/*******************************************************************************************************************//**
 * Get activation status with AT+CGACT command.
 *
 * @param[in] cellularHandle        Cellular handle provided by init command.
 * @param[in] pPdpContextsActInfo   Struct to store activation info in.
 *
 * @retval  See _Cellular_AtcmdRequestWithCallback
 **********************************************************************************************************************/
static CellularError_t _Cellular_GetContextActivationStatus (CellularHandle_t              cellularHandle,
                                                             CellularPdnContextActInfo_t * pPdpContextsActInfo)
{
    CellularContext_t * pContext       = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;

    CellularAtReq_t atReqPacketSwitchStatus =
    {
        "AT+CGACT?",
        CELLULAR_AT_MULTI_WITH_PREFIX,
        "+CGACT",
        _Cellular_RecvFuncGetPdpContextActState,
        pPdpContextsActInfo,
        sizeof(CellularPdnContextActInfo_t),
    };

    /* Internal function. Callee check parameters. */
    pktStatus      = _Cellular_AtcmdRequestWithCallback(pContext, atReqPacketSwitchStatus);
    cellularStatus = _Cellular_TranslatePktStatus(pktStatus);

