renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
    return cellularStatus;
}

/*******************************************************************************************************************//**
 * Callback to process AT+CGACT response.
 *
 * @param[in] pContext  Pointer to cellular context.
 * @param[in] pAtResp   Pointer to AT command response.
 * @param[in] pData     Pointer to where to store parsed data.
 * @param[in] dataLen   Length of where to store parsed data.
 *
 * @retval  CELLULAR_PKT_STATUS_OK          Response processing succeeded
 * @retval  CELLULAR_PKT_STATUS_FAILURE     Parsing failure
 * @retval  CELLULAR_PKT_STATUS_BAD_PARAM   Bad parameter passed to callback
 **********************************************************************************************************************/
static CellularPktStatus_t _Cellular_RecvFuncGetPdpContextActState (CellularContext_t                 * pContext,
                                                                    const CellularATCommandResponse_t * pAtResp,
                                                                    void                              * pData,
                                                                    uint16_t                            dataLen)
{
    char * pRespLine = NULL;
    CellularPdnContextActInfo_t   * pPDPContextsActInfo = (CellularPdnContextActInfo_t *) pData;
    CellularPktStatus_t             pktStatus           = CELLULAR_PKT_STATUS_OK;
    CellularATError_t               atCoreStatus        = CELLULAR_AT_SUCCESS;
    const CellularATCommandLine_t * pCommandItem        = NULL;
    uint8_t tokenIndex = 0;
    uint8_t contextId  = 0;
    int32_t tempValue  = 0;
    char  * pToken     = NULL;

    if (pContext == NULL)
    {
        LogError(("_Cellular_RecvFuncGetPdpContextActState: invalid context"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else if ((pPDPContextsActInfo == NULL) || (dataLen != sizeof(CellularPdnContextActInfo_t)))
    {
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else if (pAtResp == NULL)
    {
        LogError(("_Cellular_RecvFuncGetPdpContextActState: Response is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else if ((pAtResp->pItm == NULL) || (pAtResp->pItm->pLine == NULL))
    {
        LogError(("_Cellular_RecvFuncGetPdpContextActState: no PDN context available"));
        pktStatus = CELLULAR_PKT_STATUS_OK;
    }
    else
    {
        pRespLine = pAtResp->pItm->pLine;

        pCommandItem = pAtResp->pItm;

        /* WAIT_LOOP */
        while (pCommandItem != NULL)
        {
            pRespLine = pCommandItem->pLine;
            LogDebug(("_Cellular_RecvFuncGetPdpContextActState: pRespLine [%s]", pRespLine));

            /* Removing all the Spaces in the AT Response. */
            atCoreStatus = Cellular_ATRemoveAllWhiteSpaces(pRespLine);

            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                atCoreStatus = Cellular_ATRemovePrefix(&pRespLine);

                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                {
                    atCoreStatus = Cellular_ATRemoveAllDoubleQuote(pRespLine);
                }

                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                {
                    atCoreStatus = Cellular_ATGetNextTok(&pRespLine, &pToken);
                }

                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                {
                    tokenIndex = 0;

                    /* WAIT_LOOP */
                    while ((pToken != NULL) && (atCoreStatus == CELLULAR_AT_SUCCESS))
                    {
                        switch (tokenIndex)
                        {
                            case (RM_CELLULAR_RYZ_PDN_ACT_STATUS_POS_CONTEXT_ID):
                            {
                                LogDebug(("_Cellular_RecvFuncGetPdpContextActState: Context Id pToken: %s", pToken));
                                atCoreStatus = Cellular_ATStrtoi(pToken, 10, &tempValue);

                                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                                {
                                    if ((tempValue >= (int32_t) CELLULAR_PDN_CONTEXT_ID_MIN) &&
                                        (tempValue <= (int32_t) RM_CELLULAR_RYZ_MAX_PDP_CONTEXTS))
                                    {
                                        contextId = (uint8_t) tempValue;
                                        pPDPContextsActInfo->contextsPresent[contextId - 1] = true;
                                        LogDebug(("_Cellular_RecvFuncGetPdpContextActState: Context Id: %d",
                                                  contextId));
                                    }
                                    else
                                    {
                                        LogError((
                                                     "_Cellular_RecvFuncGetPdpContextActState: Invalid Context Id. Token %s",
                                                     pToken));
                                        atCoreStatus = CELLULAR_AT_ERROR;
                                    }
                                }

                                break;
                            }

                            case (RM_CELLULAR_RYZ_PDN_ACT_STATUS_POS_CONTEXT_STATE):
                            {
                                LogDebug(("_Cellular_RecvFuncGetPdpContextActState: Context <Act> pToken: %s", pToken));
                                atCoreStatus = Cellular_ATStrtoi(pToken, 10, &tempValue);

                                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                                {
                                    pPDPContextsActInfo->contextActState[contextId - 1] = (bool) tempValue;
                                    LogDebug(("_Cellular_RecvFuncGetPdpContextActState: Context <Act>: %d",
                                              pPDPContextsActInfo->contextActState[contextId - 1]));
                                }

                                break;
                            }

                            default:
                            {
                                break;
                            }
                        }

                        tokenIndex++;

                        if (Cellular_ATGetNextTok(&pRespLine, &pToken) != CELLULAR_AT_SUCCESS)
                        {
                            break;
                        }
                    }
                }
            }

            pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);

            if (pktStatus != CELLULAR_PKT_STATUS_OK)
            {
                LogError(("_Cellular_RecvFuncGetPdpContextActState: parse %s failed", pRespLine));
                break;
            }

            pCommandItem = pCommandItem->pNext;
        }
    }

    return pktStatus;
}

/*******************************************************************************************************************//**
 * Get packet switch status with AT+CGATT?
 *
 * @param[in] cellularHandle        Cellular handle provided by init command.
 * @param[in] pPacketSwitchStatus   Location to store status.
 *
 * @retval  See _Cellular_TimeoutAtcmdRequestWithCallback
 **********************************************************************************************************************/
static CellularError_t _Cellular_GetPacketSwitchStatus (CellularHandle_t cellularHandle, bool * pPacketSwitchStatus)
{
    CellularContext_t * pContext                = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus          = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus               = CELLULAR_PKT_STATUS_OK;
    CellularAtReq_t     atReqPacketSwitchStatus =
    {
        "AT+CGATT?",
        CELLULAR_AT_WITH_PREFIX,
        "+CGATT",
        _Cellular_RecvFuncPacketSwitchStatus,
        pPacketSwitchStatus,
        sizeof(bool),
    };

    /* Internal function. Callee check parameters. */
    pktStatus = _Cellular_TimeoutAtcmdRequestWithCallback(pContext,
                                                          atReqPacketSwitchStatus,
                                                          RM_CELLULAR_RYZ_PDN_ACT_PACKET_REQ_TIMEOUT_MS);
    cellularStatus = _Cellular_TranslatePktStatus(pktStatus);

