renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
    return cellularStatus;
}

/*******************************************************************************************************************//**
 * Callback to process AT+CGATT response.
 *
 * @param[in] pContext  Pointer to cellular context.
 * @param[in] pAtResp   Pointer to AT command response.
 * @param[in] pData     Pointer to where to store parsed data.
 * @param[in] dataLen   Length of where to store parsed data.
 *
 * @retval  CELLULAR_PKT_STATUS_OK          Response processing succeeded
 * @retval  CELLULAR_PKT_STATUS_FAILURE     Parsing failure
 * @retval  CELLULAR_PKT_STATUS_BAD_PARAM   Bad parameter passed to callback
 **********************************************************************************************************************/
static CellularPktStatus_t _Cellular_RecvFuncPacketSwitchStatus (CellularContext_t                 * pContext,
                                                                 const CellularATCommandResponse_t * pAtResp,
                                                                 void                              * pData,
                                                                 uint16_t                            dataLen)
{
    char              * pInputLine          = NULL;
    CellularPktStatus_t pktStatus           = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus        = CELLULAR_AT_SUCCESS;
    bool              * pPacketSwitchStatus = (bool *) pData;

    if (pContext == NULL)
    {
        LogError(("PacketSwitchStatus: Invalid handle"));
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((pData == NULL) || (dataLen != sizeof(bool)))
    {
        LogError(("GetPacketSwitchStatus: Invalid param"));
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else if ((pAtResp == NULL) || (pAtResp->pItm == NULL) || (pAtResp->pItm->pLine == NULL))
    {
        LogError(("GetPacketSwitchStatus: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        pInputLine = pAtResp->pItm->pLine;

        /* Remove prefix. */
        atCoreStatus = Cellular_ATRemovePrefix(&pInputLine);

        /* Remove leading space. */
        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            atCoreStatus = Cellular_ATRemoveLeadingWhiteSpaces(&pInputLine);
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            if (*pInputLine == '0')
            {
                *pPacketSwitchStatus = false;
            }
            else if (*pInputLine == '1')
            {
                *pPacketSwitchStatus = true;
            }
            else
            {
                atCoreStatus = CELLULAR_AT_ERROR;
            }
        }

        pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
    }

    return pktStatus;
}

/*******************************************************************************************************************//**
 * Callback to process AT+CGDCONT response.
 *
 * @param[in] pContext  Pointer to cellular context.
 * @param[in] pAtResp   Pointer to AT command response.
 * @param[in] pData     Pointer to where to store parsed data.
 * @param[in] dataLen   Length of where to store parsed data.
 *
 * @retval  CELLULAR_PKT_STATUS_OK          Response processing succeeded
 * @retval  CELLULAR_PKT_STATUS_FAILURE     Parsing failure
 * @retval  CELLULAR_PKT_STATUS_BAD_PARAM   Bad parameter passed to callback
 **********************************************************************************************************************/
static CellularPktStatus_t _Cellular_RecvFuncGetPdpContextSettings (CellularContext_t                 * pContext,
                                                                    const CellularATCommandResponse_t * pAtResp,
                                                                    void                              * pData,
                                                                    uint16_t                            dataLen)
{
    char * pRespLine = NULL;
    CellularPdnContextInfo_t      * pPDPContextsInfo = (CellularPdnContextInfo_t *) pData;
    CellularPktStatus_t             pktStatus        = CELLULAR_PKT_STATUS_OK;
    CellularATError_t               atCoreStatus     = CELLULAR_AT_SUCCESS;
    const CellularATCommandLine_t * pCommandItem     = NULL;
    uint8_t tokenIndex = 0;
    uint8_t contextId  = 0;
    int32_t tempValue  = 0;
    char  * pToken     = NULL;

    (void)(dataLen);

    if (pContext == NULL)
    {
        LogError(("_Cellular_RecvFuncGetPdpContextSettings: invalid context"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else if (pPDPContextsInfo == NULL)
    {
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else if (pAtResp == NULL)
    {
        LogError(("_Cellular_RecvFuncGetPdpContextSettings: Response is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else if ((pAtResp->pItm == NULL) || (pAtResp->pItm->pLine == NULL))
    {
        LogError(("_Cellular_RecvFuncGetPdpContextSettings: no PDN context available"));
        pktStatus = CELLULAR_PKT_STATUS_OK;
    }
    else
    {
        pRespLine = pAtResp->pItm->pLine;

        pCommandItem = pAtResp->pItm;

        /* WAIT_LOOP */
        while (pCommandItem != NULL)
        {
            pRespLine = pCommandItem->pLine;
            LogDebug(("_Cellular_RecvFuncGetPdpContextSettings: pRespLine [%s]", pRespLine));

            /* Removing all the Spaces in the AT Response. */
            atCoreStatus = Cellular_ATRemoveAllWhiteSpaces(pRespLine);

            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                atCoreStatus = Cellular_ATRemovePrefix(&pRespLine);

                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                {
                    atCoreStatus = Cellular_ATRemoveAllDoubleQuote(pRespLine);
                }

                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                {
                    atCoreStatus = Cellular_ATGetNextTok(&pRespLine, &pToken);
                }

                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                {
                    tokenIndex = 0;

                    /* WAIT_LOOP */
                    while ((pToken != NULL) && (atCoreStatus == CELLULAR_AT_SUCCESS))
                    {
                        switch (tokenIndex)
                        {
                            case (RM_CELLULAR_RYZ_PDN_STATUS_POS_CONTEXT_ID):
                            {
                                LogDebug(("_Cellular_RecvFuncGetPdpContextSettings: Context Id pToken: %s", pToken));
                                atCoreStatus = Cellular_ATStrtoi(pToken, 10, &tempValue);

                                if (atCoreStatus == CELLULAR_AT_SUCCESS)
                                {
                                    if ((tempValue >= (int32_t) CELLULAR_PDN_CONTEXT_ID_MIN) &&
                                        (tempValue <= (int32_t) RM_CELLULAR_RYZ_MAX_PDP_CONTEXTS))
                                    {
                                        contextId = (uint8_t) tempValue;
                                        pPDPContextsInfo->contextsPresent[contextId - 1] = true;
                                        LogDebug(("_Cellular_RecvFuncGetPdpContextSettings: Context Id: %d",
                                                  contextId));
                                    }
                                    else
                                    {
                                        LogError((
                                                     "_Cellular_RecvFuncGetPdpContextSettings: Invalid Context Id. Token %s",
                                                     pToken));
                                        atCoreStatus = CELLULAR_AT_ERROR;
                                    }
                                }

                                break;
                            }

                            case (RM_CELLULAR_RYZ_PDN_STATUS_POS_CONTEXT_TYPE):
                            {
                                LogDebug(("_Cellular_RecvFuncGetPdpContextSettings: Context Type pToken: %s", pToken));
                                (void) memcpy((void *) pPDPContextsInfo->ipType[contextId - 1],
                                              (void *) pToken,
                                              RM_CELLULAR_RYZ_PDN_CONTEXT_TYPE_MAX_SIZE);
                                break;
                            }

                            case (RM_CELLULAR_RYZ_PDN_STATUS_POS_APN_NAME):
                            {
                                LogDebug(("_Cellular_RecvFuncGetPdpContextSettings: Context APN name pToken: %s",
                                          pToken));
                                (void) memcpy((void *) pPDPContextsInfo->apnName[contextId - 1],
                                              (void *) pToken,
                                              CELLULAR_APN_MAX_SIZE);
                                break;
                            }

                            case (RM_CELLULAR_RYZ_PDN_STATUS_POS_IP_ADDRESS):
                            {
                                LogDebug(("_Cellular_RecvFuncGetPdpContextSettings: Context IP address pToken: %s",
                                          pToken));
                                (void) memcpy((void *) pPDPContextsInfo->ipAddress[contextId - 1],
                                              (void *) pToken,
                                              CELLULAR_IP_ADDRESS_MAX_SIZE + 1U);
                                break;
                            }

                            default:
                            {
                                break;
                            }
                        }

                        tokenIndex++;

                        if (Cellular_ATGetNextTok(&pRespLine, &pToken) != CELLULAR_AT_SUCCESS)
                        {
                            break;
                        }
                    }
                }
            }

            pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);

            if (pktStatus != CELLULAR_PKT_STATUS_OK)
            {
                LogError(("_Cellular_RecvFuncGetPdpContextSettings: parse %s failed", pRespLine));
                break;
            }

            pCommandItem = pCommandItem->pNext;
        }
    }

    return pktStatus;
}

