renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
static bool _parseSignalQuality (char * pQcsqPayload, CellularSignalInfo_t * pSignalInfo)
{
    char            * pToken          = NULL;
    char            * pTmpQcsqPayload = pQcsqPayload;
    int32_t           tempValue       = 0;
    bool              parseStatus     = true;
    CellularATError_t atCoreStatus    = CELLULAR_AT_SUCCESS;

    if ((pSignalInfo == NULL) || (pQcsqPayload == NULL))
    {
        LogError(("_parseSignalQuality: Invalid Input Parameters"));
        parseStatus = false;
    }

    /* +CSQ: <signal_power>,<qual>. */

    /* Parse <signal_power>. */
    atCoreStatus = Cellular_ATGetNextTok(&pTmpQcsqPayload, &pToken);

    if (atCoreStatus == CELLULAR_AT_SUCCESS)
    {
        atCoreStatus = Cellular_ATStrtoi(pToken, 10, &tempValue);

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /*
             * The allowed range is 0-31 and 99.
             *  0           RSSI of the network <= -113 dBm
             *  1           -111 dBm
             *  2...30      -109 dBm <= RSSI of the network <= -53 dBm
             *  31          -51 dBm <= RSSI of the network
             *  99          Not known or not detectable
             */
            if ((tempValue >= 0) && (tempValue <= 31))                    // NOLINT(readability-magic-numbers)
            {
                pSignalInfo->rssi = (int16_t) ((-113) + (tempValue * 2)); // NOLINT(readability-magic-numbers)
            }
            else if (tempValue == 99)                                     // NOLINT(readability-magic-numbers)
            {
                pSignalInfo->rssi = -113;                                 // NOLINT(readability-magic-numbers)
            }
            else
            {
                pSignalInfo->rssi = CELLULAR_INVALID_SIGNAL_VALUE;
            }
        }
        else
        {
            LogError(("_parseSignalQuality: Error in processing RSSI. Token %s", pToken));
            parseStatus = false;
        }
    }

    /* Parse <qual>. */
    if (atCoreStatus == CELLULAR_AT_SUCCESS)
    {
        atCoreStatus = Cellular_ATGetNextTok(&pTmpQcsqPayload, &pToken);
    }

    if (atCoreStatus == CELLULAR_AT_SUCCESS)
    {
        atCoreStatus = Cellular_ATStrtoi(pToken, 10, &tempValue);

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /*
             * The allowed range is 0-7 and 99 :
             *  In 2G RAT CS dedicated and GPRS packet transfer mode indicates the Bit Error Rate (BER) as specified in 3GPP TS 45.008
             */
            if ((tempValue >= 0) && (tempValue <= 7))
            {
                pSignalInfo->ber = (int16_t) tempValue;
            }
            else
            {
                pSignalInfo->ber = CELLULAR_INVALID_SIGNAL_VALUE;
            }
        }
        else
        {
            LogError(("_parseSignalQuality: Error in processing ber. Token %s", pToken));
            parseStatus = false;
        }
    }

    return parseStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncResolveDomainToIpAddress (CellularContext_t                 * pContext,
                                                                       const CellularATCommandResponse_t * pAtResp,
                                                                       void                              * pData,
                                                                       uint16_t                            dataLen)
{
    (void)dataLen;

    char * pInputLine = NULL;
    char pRecvInfo[40] = {0};
    bool parseStatus = true;
    CellularPktStatus_t pktStatus = CELLULAR_PKT_STATUS_OK;
    CellularATError_t atCoreStatus = CELLULAR_AT_SUCCESS;

    if( pContext == NULL )
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if( ( pAtResp == NULL ) || ( pAtResp->pItm == NULL ) || ( pAtResp->pItm->pLine == NULL ) )
    {
        LogError(( "GetHostByNameInfo: Input Line passed is NULL" ));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        pInputLine = pAtResp->pItm->pLine;
        atCoreStatus = Cellular_ATRemovePrefix( &pInputLine );

        if( atCoreStatus == CELLULAR_AT_SUCCESS )
        {
            atCoreStatus = Cellular_ATRemoveAllDoubleQuote( pInputLine );
        }

        if( atCoreStatus == CELLULAR_AT_SUCCESS )
        {
            atCoreStatus = Cellular_ATRemoveAllWhiteSpaces( pInputLine );
        }

        if( atCoreStatus != CELLULAR_AT_SUCCESS )
        {
            pktStatus = _Cellular_TranslateAtCoreStatus( atCoreStatus );
        }
    }

    if( pktStatus == CELLULAR_PKT_STATUS_OK )
    {
        parseStatus = _parseGetHostByName( pInputLine, pRecvInfo );

        if( parseStatus == true )
        {
            ( void ) strcpy( (char *)pData, &pRecvInfo[0] );
        }
        else
        {
            pktStatus = CELLULAR_PKT_STATUS_FAILURE;
        }
    }

    return pktStatus;
}

static bool _parseGetHostByName( char * pQcsqPayload, char * pGetHostInfo )
{
    char * pToken          = NULL;
    char * pTmpQcsqPayload = pQcsqPayload;
    bool   parseStatus     = true;

    if( ( pGetHostInfo == NULL ) || ( pQcsqPayload == NULL ) )
    {
        LogError(( "_parseGetHostByName: Invalid Input Parameters" ));
        parseStatus = false;
    }

    if( ( parseStatus == true ) && ( Cellular_ATGetNextTok( &pTmpQcsqPayload, &pToken ) != CELLULAR_AT_SUCCESS ) )
    {
        LogError(( "_parseGetHostByName: Error in processing HostName. Token %s", pToken ));
        parseStatus = false;
    }

    if( ( parseStatus == true ) && ( Cellular_ATGetNextTok( &pTmpQcsqPayload, &pToken ) == CELLULAR_AT_SUCCESS ) )
    {
         ( void ) strcpy( pGetHostInfo, pToken );
    }
    else
    {
        LogError(( "_parseGetHostByName: Error in processing HostName. Token %s", pToken ));
        parseStatus = false;
    }

    return parseStatus;
}

static CellularPktStatus_t socketSendDataPrefix (void * pCallbackContext, char * pLine, uint32_t * pBytesRead)
{
    CellularPktStatus_t pktStatus = CELLULAR_PKT_STATUS_OK;

    if ((pLine == NULL) || (pBytesRead == NULL))
    {
        LogError(("socketSendDataPrefix: pLine is invalid or pBytesRead is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else if (pCallbackContext != NULL)
    {
        LogError(("socketSendDataPrefix: pCallbackContext is not NULL"));
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else if (*pBytesRead != 2U)
    {
        LogDebug(("socketSendDataPrefix: pBytesRead %u %s is not 2", (unsigned int) *pBytesRead, pLine));
    }
    else
    {
        /* After the data prefix, there should not be any data in stream.
         * Cellular commmon processes AT command in lines. Add a '\0' after '@'. */
        if (strcmp(pLine, "> ") == 0)
        {
            pLine[2]    = '\n';
            *pBytesRead = 3;
        }
    }

    return pktStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncData (CellularContext_t                 * pContext,
                                                   const CellularATCommandResponse_t * pAtResp,
                                                   void                              * pData,
                                                   uint16_t                            dataLen)
{
    CellularATError_t         atCoreStatus = CELLULAR_AT_SUCCESS;
    CellularPktStatus_t       pktStatus    = CELLULAR_PKT_STATUS_OK;
    char                    * pInputLine   = NULL;
    char                    * pToken       = NULL;
    const _socketDataRecv_t * pDataRecv    = (_socketDataRecv_t *) pData;
    int32_t                   tempValue    = 0;

    (void) dataLen;

    if (pContext == NULL)
    {
        LogError(("Receive Data: invalid context"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else if ((pAtResp == NULL) || (pAtResp->pItm == NULL) || (pAtResp->pItm->pLine == NULL))
    {
        LogError(("Receive Data: response is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else if ((pDataRecv == NULL) || (pDataRecv->pData == NULL) || (pDataRecv->pDataLen == NULL))
    {
        LogError(("Receive Data: Bad parameters"));
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else
    {
        pInputLine = pAtResp->pItm->pLine; /* The first item is the data prefix. */

