renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        /* Check the data prefix token "+SQNSRECV: ". */
        if (strncmp(pInputLine, RM_CELLULAR_RYZ_SOCKET_DATA_PREFIX_TOKEN,
                    RM_CELLULAR_RYZ_SOCKET_DATA_PREFIX_TOKEN_LEN) != 0)
        {
            LogError(("response item error in prefix"));
            atCoreStatus = CELLULAR_AT_ERROR;
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /* Get the socket ID */
            atCoreStatus = Cellular_ATGetNextTok(&pInputLine, &pToken);

            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                /* Get the bytes received */
                atCoreStatus = Cellular_ATGetNextTok(&pInputLine, &pToken);
            }

            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                atCoreStatus = Cellular_ATStrtoi(pToken, 10, &tempValue);
            }

            /* Process the data buffer. */
            if (atCoreStatus == CELLULAR_AT_SUCCESS)
            {
                *pDataRecv->pDataLen = (uint32_t) tempValue;
                atCoreStatus         = getDataFromResp(pAtResp, pDataRecv, *pDataRecv->pDataLen);
            }
        }

        pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
    }

    return pktStatus;
}

static CellularATError_t getDataFromResp (const CellularATCommandResponse_t * pAtResp,
                                          const _socketDataRecv_t           * pDataRecv,
                                          uint32_t                            outBufSize)
{
    CellularATError_t atCoreStatus  = CELLULAR_AT_SUCCESS;
    const char      * pInputLine    = NULL;
    uint32_t          dataLenToCopy = 0;

    /* Check if the received data size is greater than the output buffer size. */
    if (*pDataRecv->pDataLen > outBufSize)
    {
        LogError(("Data is truncated, received data length %u, out buffer size %u",
                  (unsigned int) *pDataRecv->pDataLen, (unsigned int) outBufSize));
        dataLenToCopy        = outBufSize;
        *pDataRecv->pDataLen = outBufSize;
    }
    else
    {
        dataLenToCopy = *pDataRecv->pDataLen;
    }

    /* Data is stored in the next intermediate response. */
    if (pAtResp->pItm->pNext != NULL)
    {
        pInputLine = pAtResp->pItm->pNext->pLine;

        if ((pInputLine != NULL) && (dataLenToCopy > 0U))
        {
            /* Copy the data to the out buffer. */
            (void) memcpy((void *) pDataRecv->pData, (const void *) pInputLine, dataLenToCopy);
        }
        else
        {
            LogError(("Receive Data: paramerter error, data pointer %p, data to copy %u",
                      pInputLine, (unsigned int) dataLenToCopy));
            atCoreStatus = CELLULAR_AT_BAD_PARAMETER;
        }
    }
    else if (*pDataRecv->pDataLen == 0U)
    {
        /* Receive command success but no data. */
        LogDebug(("Receive Data: no data"));
    }
    else
    {
        LogError(("Receive Data: Intermediate response empty"));
        atCoreStatus = CELLULAR_AT_BAD_PARAMETER;
    }

    return atCoreStatus;
}

static CellularPktStatus_t socketRecvDataPrefix (void     * pCallbackContext,
                                                 char     * pLine,
                                                 uint32_t   lineLength,
                                                 char    ** ppDataStart,
                                                 uint32_t * pDataLength)
{
    char              * pDataStart       = NULL;
    uint32_t            prefixLineLength = 0U;
    int32_t             tempValue        = 0;
    CellularATError_t   atResult         = CELLULAR_AT_SUCCESS;
    CellularPktStatus_t pktStatus        = CELLULAR_PKT_STATUS_OK;
    uint32_t            i                = 0;
    char                pLocalLine[RM_CELLULAR_RYZ_MAX_SQNSSRECV_STRING_PREFIX_STRING + 1] = "\0";
    uint32_t            localLineLength = RM_CELLULAR_RYZ_MAX_SQNSSRECV_STRING_PREFIX_STRING >
                                          lineLength ? lineLength : RM_CELLULAR_RYZ_MAX_SQNSSRECV_STRING_PREFIX_STRING;

    (void) pCallbackContext;

    if ((pLine == NULL) || (ppDataStart == NULL) || (pDataLength == NULL))
    {
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else
    {
        /* Check if the message is a data response. */
        if (strncmp(pLine, RM_CELLULAR_RYZ_SOCKET_DATA_PREFIX_TOKEN, RM_CELLULAR_RYZ_SOCKET_DATA_PREFIX_TOKEN_LEN) == 0)
        {
            strncpy(pLocalLine, pLine, RM_CELLULAR_RYZ_MAX_SQNSSRECV_STRING_PREFIX_STRING);
            pLocalLine[RM_CELLULAR_RYZ_MAX_SQNSSRECV_STRING_PREFIX_STRING] = '\0';
            pDataStart = pLocalLine;

            /* WAIT_LOOP */
            /* Add a '\0' char at the end of the line. */
            for (i = 0; i < localLineLength; i++)
            {
                if ((pDataStart[i] == '\r') || (pDataStart[i] == '\n'))
                {
                    pDataStart[i]    = '\0';
                    prefixLineLength = i;
                    break;
                }
            }

            if (i == localLineLength)
            {
                LogDebug(("Data prefix invalid line : %s", pLocalLine));
                pDataStart = NULL;
            }
        }

        if (pDataStart != NULL)
        {
            atResult = Cellular_ATStrtoi(&pDataStart[strlen("+SQNSRECV: 1,")], 10, &tempValue);

            if ((atResult == CELLULAR_AT_SUCCESS) && (tempValue >= 0) &&
                (tempValue <= (int32_t) CELLULAR_MAX_RECV_DATA_LEN))
            {
                if ((prefixLineLength + RM_CELLULAR_RYZ_DATA_PREFIX_STRING_CHANGELINE_LENGTH) > lineLength)
                {
                    /* More data is required. */
                    *pDataLength = 0;
                    pDataStart   = NULL;
                    pktStatus    = CELLULAR_PKT_STATUS_SIZE_MISMATCH;
                }
                else
                {
                    pDataStart    = &pLine[prefixLineLength];
                    pDataStart[0] = '\0';
                    pDataStart    = &pDataStart[RM_CELLULAR_RYZ_DATA_PREFIX_STRING_CHANGELINE_LENGTH];
                    *pDataLength  = (uint32_t) tempValue;
                }

                LogDebug(("DataLength %p at pktIo = %d", pDataStart, (unsigned int) *pDataLength));
            }
            else
            {
                *pDataLength = 0;
                pDataStart   = NULL;
                LogError(("Data response received with wrong size"));
            }
        }

        *ppDataStart = pDataStart;
    }

    return pktStatus;
}

