renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
static bool _checkCrsmMemoryStatus (const char * pToken)
{
    bool memoryStatus = true;

    if (pToken == NULL)
    {
        LogError(("Input Parameter NULL"));
        memoryStatus = false;
    }

    if (memoryStatus == true)
    {
        /* Checking the value sw2 in AT command response for memory problem during CRSM read.
         * Refer 3GPP Spec TS 51.011 Section 9.4. */
        if (strcmp(pToken, "64") == 0) /* '40' memory problem. */
        {
            LogError(("_checkCrsmMemoryStatus: Error in Processing HPLMN: CRSM Memory Error"));
            memoryStatus = false;
        }
    }

    return memoryStatus;
}

/*-----------------------------------------------------------*/

static bool _checkCrsmReadStatus (const char * pToken)
{
    bool readStatus = true;

    if (pToken == NULL)
    {
        LogError(("Input Parameter NULL"));
        readStatus = false;
    }

    if (readStatus == true)
    {
        /* Checking the parameter sw1 in AT command response for successful CRSM read.
         * Refer 3GPP Spec TS 51.011 Section 9.4. */
        if ((strcmp(pToken, "144") != 0) && /* '90' normal ending of the command. */
            (strcmp(pToken, "145") != 0) && /* '91' normal ending of the command, with extra information. */
            (strcmp(pToken, "146") != 0))   /* '92' command successful but after using an internal update retry routine 'X' times. */
        {
            LogError(("_checkCrsmReadStatus: Error in Processing HPLMN: CRSM Read Error"));
            readStatus = false;
        }
    }

    return readStatus;
}

/*-----------------------------------------------------------*/

static bool _parseHplmn (char * pToken, void * pData)
{
    bool                 parseStatus = true;
    CellularPlmnInfo_t * plmn        = (CellularPlmnInfo_t *) pData;

    if (pToken == NULL)
    {
        LogError(("_parseHplmn: pToken is NULL or pData is NULL"));
        parseStatus = false;
    }
    else if (strlen(pToken) < (RM_CELLULAR_RYZ_CRSM_HPLMN_RAT_LENGTH))
    {
        LogError(("_parseHplmn: Error in processing HPLMN invalid token %s", pToken));
        parseStatus = false;
    }
    else
    {
        /* Returning only the very first HPLMN present in EFHPLMNwACT in SIM.
         * EF-HPLMNwACT can contain a maximum of 10 HPLMN entries in decreasing order of priority.
         * In this implementation, returning the very first HPLMN is the PLMN priority list. */

        /* Refer TS 51.011 Section 10.3.37 for encoding. */
        plmn->mcc[0] = pToken[1];
        plmn->mcc[1] = pToken[0];
        plmn->mcc[2] = pToken[3];
        plmn->mnc[0] = pToken[5];
        plmn->mnc[1] = pToken[4];

        if (pToken[2] != 'F')
        {
            plmn->mnc[2] = pToken[2];
            plmn->mnc[3] = '\0';
        }
        else
        {
            plmn->mnc[2] = '\0';
        }
    }

    return parseStatus;
}

/*-----------------------------------------------------------*/

static CellularPktStatus_t _Cellular_RecvFuncGetHplmn (CellularContext_t                 * pContext,
                                                       const CellularATCommandResponse_t * pAtResp,
                                                       void                              * pData,
                                                       uint16_t                            dataLen)
{
    bool                parseStatus   = true;
    CellularPktStatus_t pktStatus     = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus  = CELLULAR_AT_SUCCESS;
    char              * pCrsmResponse = NULL;
    char              * pToken        = NULL;

    if (pContext == NULL)
    {
        LogError(("GetHplmn: pContext is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((pAtResp == NULL) || (pAtResp->pItm == NULL) || (pAtResp->pItm->pLine == NULL))
    {
        LogError(("GetHplmn: Response is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else if ((pData == NULL) || (dataLen != sizeof(CellularPlmnInfo_t)))
    {
        LogError(("GetHplmn: pData is invalid or dataLen is wrong"));
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else
    {
        pCrsmResponse = pAtResp->pItm->pLine;
        atCoreStatus  = Cellular_ATRemoveAllWhiteSpaces(pCrsmResponse);

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /* Removing the CRSM prefix in AT Response. */
            atCoreStatus = Cellular_ATRemovePrefix(&pCrsmResponse);
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /* Removing All quotes in the AT Response. */
            atCoreStatus = Cellular_ATRemoveAllDoubleQuote(pCrsmResponse);
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /* Getting the next token separated by comma in At Response. */
            atCoreStatus = Cellular_ATGetNextTok(&pCrsmResponse, &pToken);
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            parseStatus = _checkCrsmReadStatus(pToken);

            if (parseStatus == false)
            {
                atCoreStatus = CELLULAR_AT_ERROR;
            }
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            atCoreStatus = Cellular_ATGetNextTok(&pCrsmResponse, &pToken);
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            parseStatus = _checkCrsmMemoryStatus(pToken);

            if (parseStatus == false)
            {
                atCoreStatus = CELLULAR_AT_ERROR;
            }
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            atCoreStatus = Cellular_ATGetNextTok(&pCrsmResponse, &pToken);
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            parseStatus = _parseHplmn(pToken, pData);

            if (parseStatus == false)
            {
                atCoreStatus = CELLULAR_AT_ERROR;
            }
        }

        pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
    }

    return pktStatus;
}

/*-----------------------------------------------------------*/

static CellularPktStatus_t _Cellular_RecvFuncGetIccid (CellularContext_t                 * pContext,
                                                       const CellularATCommandResponse_t * pAtResp,
                                                       void                              * pData,
                                                       uint16_t                            dataLen)
{
    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus = CELLULAR_AT_SUCCESS;
    char              * pRespLine    = NULL;
    char              * pToken       = NULL;

    if (pContext == NULL)
    {
        LogError(("getIccid: pContext is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((pAtResp == NULL) || (pAtResp->pItm == NULL) ||
             (pAtResp->pItm->pLine == NULL))
    {
        LogError(("getIccid: Response is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else if ((pData == NULL) || (dataLen != (CELLULAR_ICCID_MAX_SIZE + 1U)))
    {
        LogError(("getIccid: pData is invalid or dataLen is wrong"));
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else
    {
        pRespLine    = pAtResp->pItm->pLine;
        atCoreStatus = Cellular_ATRemoveAllWhiteSpaces(pRespLine);

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /* Removing QCCID Prefix in AT Response. */
            atCoreStatus = Cellular_ATRemovePrefix(&pRespLine);
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /* Removing All quotes in the AT Response. */
            atCoreStatus = Cellular_ATRemoveAllDoubleQuote(pRespLine);
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /* Getting the next token separated by comma in At Response. */
            atCoreStatus = Cellular_ATGetNextTok(&pRespLine, &pToken);
        }

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            /* Storing the ICCID value in the AT Response. */
            if (strlen(pToken) < ((size_t) CELLULAR_ICCID_MAX_SIZE + 1U))
            {
                (void) strncpy(pData, pToken, dataLen);
            }
            else
            {
                atCoreStatus = CELLULAR_AT_BAD_PARAMETER;
            }
        }

        pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
    }

    return pktStatus;
}

/*-----------------------------------------------------------*/

static CellularPktStatus_t _Cellular_RecvFuncGetImsi (CellularContext_t                 * pContext,
                                                      const CellularATCommandResponse_t * pAtResp,
                                                      void                              * pData,
                                                      uint16_t                            dataLen)
{
    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus = CELLULAR_AT_SUCCESS;
    char              * pRespLine    = NULL;

    if (pContext == NULL)
    {
        LogError(("getImsi: pContext is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((pAtResp == NULL) || (pAtResp->pItm == NULL) || (pAtResp->pItm->pLine == NULL))
    {
        LogError(("getImsi: Response is invalid"));
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else if ((pData == NULL) || (dataLen != (CELLULAR_IMSI_MAX_SIZE + 1U)))
    {
        LogError(("getImsi: pData is invalid or dataLen is wrong"));
        pktStatus = CELLULAR_PKT_STATUS_BAD_PARAM;
    }
    else
    {
        pRespLine = pAtResp->pItm->pLine;

