renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        /* Removing all the Spaces in the AT Response. */
        atCoreStatus = Cellular_ATRemoveAllWhiteSpaces(pRespLine);

        if (atCoreStatus == CELLULAR_AT_SUCCESS)
        {
            if (strlen(pRespLine) < (CELLULAR_IMSI_MAX_SIZE + 1U))
            {
                (void) strncpy((char *) pData, pRespLine, dataLen);
            }
            else
            {
                atCoreStatus = CELLULAR_AT_ERROR;
            }
        }

        pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
    }

    return pktStatus;
}

/* Implementation of Cellular_SetPdnConfig */
CellularError_t Cellular_SetPdnConfig (CellularHandle_t            cellularHandle,
                                       uint8_t                     contextId,
                                       const CellularPdnConfig_t * pPdnConfig)
{
    CellularContext_t * pContext       = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    char cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'}; /* APN and auth info is too long */

    CellularAtReq_t atReqSetPdn =
    {
        cmdBuf,
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    if (pPdnConfig == NULL)
    {
        LogError(("Cellular_ATCommandRaw: Input parameter is NULL"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }

    if (cellularStatus == CELLULAR_SUCCESS)
    {
        cellularStatus = _Cellular_IsValidPdn(contextId);
    }

    if (cellularStatus == CELLULAR_SUCCESS)
    {
        /* Make sure the library is open. */
        cellularStatus = _Cellular_CheckLibraryStatus(pContext);
    }

    if (cellularStatus == CELLULAR_SUCCESS)
    {
        semaphore_ret = aws_cellular_rts_deactive(pContext);

        const char * pPdnType;

        /* Set PDN context IP type string for AT+CGDCONT */
        if (pPdnConfig->pdnContextType == CELLULAR_PDN_CONTEXT_IPV6)
        {
            pPdnType = "IPV6";
        }
        else if (pPdnConfig->pdnContextType == CELLULAR_PDN_CONTEXT_IPV4V6)
        {
            pPdnType = "IPV4V6";
        }
        else
        {
            pPdnType = "IP";           // default: CELLULAR_PDN_CONTEXT_IPV4
        }

        if ((pPdnConfig->pdnContextType == CELLULAR_PDN_CONTEXT_IPV4V6) ||
                (pPdnConfig->pdnContextType == CELLULAR_PDN_CONTEXT_IPV6))
        {
            /* IPv6 address format setting */
            (void)snprintf(cmdBuf, sizeof(cmdBuf), "AT+CGPIAF=1,0,1,0");
            pktStatus = _Cellular_AtcmdRequestWithCallback(pContext, atReqSetPdn);

            if (pktStatus != CELLULAR_PKT_STATUS_OK)
            {
                LogError(("Cellular_SetPdnConfig: can't set PDN, cmdBuf:%s, PktRet: %d", cmdBuf, pktStatus));
                cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
            }
        }

        if (cellularStatus == CELLULAR_SUCCESS)
        {
            /* Build AT+CGDCONT command to set the PDN context type and APN name */
            (void) snprintf(cmdBuf, sizeof(cmdBuf), "AT+CGDCONT=%d,\"%s\",\"%s\"", contextId, pPdnType,
                            pPdnConfig->apnName);

            pktStatus = _Cellular_AtcmdRequestWithCallback(pContext, atReqSetPdn);

            if (pktStatus != CELLULAR_PKT_STATUS_OK)
            {
                LogError(("Cellular_SetPdnConfig: can't set PDN, cmdBuf:%s, PktRet: %d", cmdBuf, pktStatus));
                cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
            }
        }


        if (cellularStatus == CELLULAR_SUCCESS)
        {
            /* Check if APN authentication is specified */
            if (pPdnConfig->pdnAuthType == CELLULAR_PDN_AUTH_NONE)
            {
                (void) snprintf(cmdBuf, sizeof(cmdBuf), "AT+CGAUTH=%d,0", contextId);
            }
            else
            {
                /* Send AT+CGAUTH command to set APN authentication type, username, and password */
                (void) snprintf(cmdBuf,
                                sizeof(cmdBuf),
                                "AT+CGAUTH=%d,%d,\"%s\",\"%s\"",
                                contextId,
                                pPdnConfig->pdnAuthType,
                                pPdnConfig->username,
                                pPdnConfig->password);
            }

            pktStatus = _Cellular_AtcmdRequestWithCallback(pContext, atReqSetPdn);

            if (pktStatus != CELLULAR_PKT_STATUS_OK)
            {
                LogError(("Cellular_SetPdnConfig: can't set PDN, cmdBuf:%s, PktRet: %d", cmdBuf, pktStatus));
                cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
            }
        }

        aws_cellular_rts_active(pContext, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_GetPhoneNum */
CellularError_t Cellular_GetPhoneNum(CellularHandle_t cellularHandle,
                                     const uint8_t  * p_phonenum)
{
    CellularContext_t * p_context       = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqGetPhonenum =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_WITH_PREFIX,
        "+CNUM",
        _Cellular_RecvFuncGetPhoneNum,
        (void *)p_phonenum, //cast
        CELLULAR_PHONENUM_MAX_SIZE,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_GetPhoneNum: _Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == p_phonenum)
    {
        LogError(("Cellular_GetPhoneNum: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CNUM");    //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqGetPhonenum);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_GetPhoneNum: couldn't resolve phone number"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

