renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncGetPhoneNum(CellularContext_t                 * p_context,
                                                         const CellularATCommandResponse_t * p_atresp,
                                                         void                              * p_data,
                                                         uint16_t                            dataLen)
{
    (void)dataLen;

    uint8_t * p_inputline                              = NULL;
    uint8_t   phonenum[CELLULAR_PHONENUM_MAX_SIZE + 1] = {0};
    bool      parseStatus                              = true;

    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus = CELLULAR_AT_SUCCESS;

    if (NULL == p_context)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((NULL == p_atresp) || (NULL == p_atresp->pItm) || (NULL == p_atresp->pItm->pLine))
    {
        LogError(("_Cellular_RecvFuncGetPhoneNum: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        p_inputline  = (uint8_t *)p_atresp->pItm->pLine;                //cast
        atCoreStatus = Cellular_ATRemovePrefix((char **)&p_inputline);  /* Fixed build error on CC-RL. */

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllDoubleQuote((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllWhiteSpaces((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS != atCoreStatus)
        {
            pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
        }
    }

    if (CELLULAR_PKT_STATUS_OK == pktStatus)
    {
        parseStatus = _parseGetPhoneNum(p_inputline, phonenum);

        if (true == parseStatus)
        {
            (void)strcpy((char *)p_data, (char *)phonenum); //cast
        }
        else
        {
            pktStatus = CELLULAR_PKT_STATUS_FAILURE;
        }
    }

    return pktStatus;
}

static bool _parseGetPhoneNum(uint8_t * p_QcsqPayload,
                              uint8_t * p_GetPhonenum)
{
    uint8_t * p_Token          = NULL;
    uint8_t * p_TmpQcsqPayload = p_QcsqPayload;
    bool      parseStatus      = true;

    CellularATError_t atCoreStatus = CELLULAR_AT_SUCCESS;

    if ((NULL == p_GetPhonenum) || (NULL == p_QcsqPayload))
    {
        LogError(("_parseGetPhoneNum: Invalid Input Parameters"));
        parseStatus = false;
    }

    if (true == parseStatus)
    {
        atCoreStatus = Cellular_ATGetNextTok((char **)&p_TmpQcsqPayload, (char **)&p_Token);  /* Fixed build error on CC-RL. */
        if (CELLULAR_AT_SUCCESS != atCoreStatus)
        {
            LogError(("_parseGetPhoneNum: Error in processing Get Phone Number. Token %s", p_Token));
            parseStatus = false;
        }
    }

    if ((true == parseStatus))
    {
        atCoreStatus = Cellular_ATGetNextTok((char **)&p_TmpQcsqPayload, (char **)&p_Token);  /* Fixed build error on CC-RL. */
        if (CELLULAR_AT_SUCCESS != atCoreStatus)
        {
            LogError(("_parseGetPhoneNum: Error in processing Get Phone Number. Token %s", p_Token));
            parseStatus = false;
        }
        else
        {
            (void)strcpy((char *)p_GetPhonenum, (char *)p_Token);   //cast
        }
    }

    return parseStatus;
}

/* Implementation of Cellular_PingRequest */
CellularError_t Cellular_PingRequest(CellularHandle_t      cellularHandle,
                                     const uint8_t * const p_hostname)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqPing =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_MULTI_WITH_PREFIX,
        "+PING",
        _Cellular_RecvFuncPingEcho,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_PingRequest: _Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == p_hostname)
    {
        LogError(("Cellular_PingRequest: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),   //cast
                        "AT+PING=\"%s\"", p_hostname);
        pktStatus = _Cellular_TimeoutAtcmdRequestWithCallback(p_context, atReqPing,
                                                                RM_CELLULAR_RYZ_DATA_SEND_TIMEOUT_MS);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_PingRequest: couldn't resolve ping"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncPingEcho(CellularContext_t                 * p_context,
                                                      const CellularATCommandResponse_t * p_atresp,
                                                      void                              * p_data,
                                                      uint16_t                            dataLen)
{
    (void)p_data;
    (void)dataLen;

    uint8_t * p_inputline = NULL;

    CellularPktStatus_t       pktStatus = CELLULAR_PKT_STATUS_OK;
    CellularATCommandLine_t * p_line    = NULL;

    if (NULL == p_context)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((NULL == p_atresp) || (NULL == p_atresp->pItm) || (NULL == p_atresp->pItm->pLine))
    {
        LogError(("_Cellular_RecvFuncPingEcho: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        p_inputline = (uint8_t *)p_atresp->pItm->pLine; //cast
        p_line      = p_atresp->pItm->pNext;
    }

    if (CELLULAR_PKT_STATUS_OK == pktStatus)
    {
        /* WAIT_LOOP */
        while (1)
        {
            if (NULL != p_context->cbEvents.genericCallback)
            {
                p_context->cbEvents.genericCallback((char *)p_inputline, p_context->cbEvents.pGenericCallbackContext);
            }

