renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
            if (NULL != p_line)
            {
                p_inputline = (uint8_t *)p_line->pLine; //cast
                p_line      = p_line->pNext;
            }
            else
            {
                break;
            }
        }
    }

    return pktStatus;
}

/* Implementation of Cellular_SetOperator */
CellularError_t Cellular_SetOperator(CellularHandle_t      cellularHandle,
                                     const uint8_t * const p_operator_name)
{
    CellularContext_t      * p_context  = (CellularContext_t *) cellularHandle;                  //cast
    st_aws_cellular_ctrl_t * p_aws_ctrl = (st_aws_cellular_ctrl_t *)p_context->pModueContext;    //cast

    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    uint8_t             resBuf[20]     = {'\0'};
    uint8_t             count          = 0;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqGetOpName =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_WITH_PREFIX,
        "+SQNCTM",
        _Cellular_RecvFuncGetOperatorName,
        resBuf,
        sizeof(resBuf),
    };

    CellularAtReq_t atReqother =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_SetOperator: _Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == p_operator_name)
    {
        LogError(("Cellular_SetOperator: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+SQNCTM?"); //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqGetOpName);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetOperator: couldn't resolve get operator name"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if ((CELLULAR_SUCCESS == cellularStatus) &&
            (strcmp((const char *)p_operator_name, (const char *)resBuf) != 0))  //cast
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        p_aws_ctrl->module_flg = AWS_CELLULAR_MODULE_FLG_INIT;

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+SQNCTM=\"%s\"", p_operator_name);  //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqother);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetOperator: couldn't resolve set operator name"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }
        else
        {
            count = 0;

            /* WAIT_LOOP */
            while (1)
            {
                if (AWS_CELLULAR_MODULE_START_FLG == p_aws_ctrl->module_flg)
                {
                    p_aws_ctrl->module_flg = AWS_CELLULAR_MODULE_FLG_INIT;
                    break;
                }
                else
                {
                    count++;
                    Platform_Delay(1000);   //cast
                }

                if (count >= AWS_CELLULAR_RESTART_LIMIT)
                {
                    cellularStatus = CELLULAR_TIMEOUT;
                    break;
                }
            }
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_SetBand */
CellularError_t Cellular_SetBand(CellularHandle_t      cellularHandle,
                                 const uint8_t * const p_band)
{
    CellularContext_t      * p_context  = (CellularContext_t *) cellularHandle;                  //cast
    st_aws_cellular_ctrl_t * p_aws_ctrl = (st_aws_cellular_ctrl_t *)p_context->pModueContext;    //cast

    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    uint8_t             resBuf[20]     = {'\0'};
    uint8_t             rat            = 0;    // 0 = M1, 1 = NB1
    uint8_t             count          = 0;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqGetOpName =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_WITH_PREFIX,
        "+SQNCTM",
        _Cellular_RecvFuncGetOperatorName,
        resBuf,
        sizeof(resBuf),
    };

    CellularAtReq_t atReqother =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_SetBand: _Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == p_band)
    {
        LogError(("Cellular_SetBand: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+SQNCTM?"); //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqGetOpName);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetBand: couldn't resolve get operator name"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf),    //cast
                        "AT+SQNBANDSEL=%d,\"%s\",\"%s\"", rat, resBuf, p_band);
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqother);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetBand: couldn't resolve set band"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }
        else
        {
            (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT^RESET");   //cast
            pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqother);

            if (CELLULAR_PKT_STATUS_OK != pktStatus)
            {
                LogError(("Cellular_SetBand: couldn't resolve reset"));
                cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
            }
            else
            {
                count = 0;

                /* WAIT_LOOP */
                while (1)
                {
                    if (AWS_CELLULAR_MODULE_START_FLG == p_aws_ctrl->module_flg)
                    {
                        p_aws_ctrl->module_flg = AWS_CELLULAR_MODULE_FLG_INIT;
                        break;
                    }
                    else
                    {
                        count++;
                        Platform_Delay(1000);   //cast
                    }

                    if (count >= AWS_CELLULAR_RESTART_LIMIT)
                    {
                        cellularStatus = CELLULAR_TIMEOUT;
                        break;
                    }
                }
            }
        }

