renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncGetOperatorName(CellularContext_t                 * p_context,
                                                             const CellularATCommandResponse_t * p_atresp,
                                                             void                              * p_data,
                                                             uint16_t                            dataLen)
{
    (void)dataLen;

    uint8_t * p_token     = NULL;
    uint8_t * p_inputline = NULL;

    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus = CELLULAR_AT_SUCCESS;

    if (NULL == p_context)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((NULL == p_atresp) || (NULL == p_atresp->pItm) || (NULL == p_atresp->pItm->pLine))
    {
        LogError(("_Cellular_RecvFuncGetOperatorName: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        p_inputline  = (uint8_t *)p_atresp->pItm->pLine;    //cast
        atCoreStatus = Cellular_ATRemovePrefix((char **)&p_inputline);  /* Fixed build error on CC-RL. */

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllDoubleQuote((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllWhiteSpaces((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATGetNextTok((char **)&p_inputline, (char **)&p_token); /* Fixed build error on CC-RL. */
        }

        if (CELLULAR_AT_SUCCESS != atCoreStatus)
        {
            pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
        }
    }

    if ((CELLULAR_PKT_STATUS_OK == pktStatus) && (NULL != p_data) && (NULL != p_token))
    {
        (void)strcpy((char *)p_data, (char *)p_token);  //cast
    }
    else
    {
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }

    return pktStatus;
}

CellularError_t Cellular_FirmUpgrade(CellularHandle_t                    cellularHandle,
                                     const uint8_t * const               p_url,
                                     const e_aws_cellular_firmupgrade_t  command,
                                     const uint8_t                       spid)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqFirmUpgrade =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_FirmUpgrade: _Cellular_CheckLibraryStatus failed"));
    }
    else if ((NULL == p_url) ||
                (command < AWS_CELLULAR_FIRM_UPGRADE_NONBLOCKING) ||
                (command > AWS_CELLULAR_FIRM_UPGRADE_CANCEL))
    {
        LogError(("Cellular_FirmUpgrade: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        if (0 == spid)
        {
            (void)snprintf((char *)cmdBuf, sizeof(cmdBuf),    //cast
                            "AT+SQNSUPGRADE=\"%s\",0,5,%d", p_url, command);
        }
        else
        {
            (void)snprintf((char *)cmdBuf, sizeof(cmdBuf),    //cast
                            "AT+SQNSUPGRADE=\"%s\",0,5,%d,%d", p_url, command, spid);
        }
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqFirmUpgrade);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_FirmUpgrade: couldn't resolve firm upgrade"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

CellularError_t Cellular_GetUpgradeState(CellularHandle_t   cellularHandle,
                                         const uint8_t    * p_state,
                                         const uint32_t     size)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqFirmUpgrade =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_WITH_PREFIX,
        "+SQNSUPGRADE",
        _Cellular_RecvFuncGetUpgradeState,
        (void *)p_state,    //cast
        size,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_GetUpgradeState: _Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == p_state)
    {
        LogError(("Cellular_GetUpgradeState: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+SQNSUPGRADE?");

        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqFirmUpgrade);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_GetUpgradeState: couldn't resolve AT+SQNSUPGRADE?"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

