renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncGetUpgradeState(CellularContext_t                  * p_context,
                                                              const CellularATCommandResponse_t * p_atresp,
                                                              void                              * p_data,
                                                              uint16_t                            dataLen)
{
    (void)dataLen;

    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;

    if (NULL == p_context)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((NULL == p_atresp) || (NULL == p_atresp->pItm) || (NULL == p_atresp->pItm->pLine))
    {
        LogError(("_Cellular_RecvFuncGetUpgradeState: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        if (dataLen > strlen(p_atresp->pItm->pLine))
        {
            sprintf(p_data, "%s", p_atresp->pItm->pLine);
        }
        else
        {
            LogError(("_Cellular_RecvFuncGetUpgradeState: Buffer size is small"));
        }
    }

    return pktStatus;
}

CellularError_t Cellular_WriteCertificate(CellularHandle_t                 cellularHandle,
                                           const e_aws_cellular_nvm_type_t data_type,
                                           const uint8_t                   index,
                                           const uint8_t * const           p_data,
                                           const uint32_t                  size)
{
    CellularContext_t * p_context      = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    uint32_t            timeout        = 1000;
    uint32_t            p_len          = 0;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t     atReqWriteCert =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    CellularAtDataReq_t atDataReqWriteCert =
    {
        p_data,
        size,
        &p_len,
        NULL,
        0
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_WriteCertificate: _Cellular_CheckLibraryStatus failed"));
    }
    else if ((NULL == p_data) ||
            ((AWS_CELLULAR_NVM_TYPE_CERTIFICATE != data_type) && (AWS_CELLULAR_NVM_TYPE_PRIVATEKEY != data_type)) ||
                (RM_CELLULAR_MAX_NVM_CERTIFICATE_INDEX < index) ||
                (RM_CELLULAR_NVM_CERTIFICATE_SIZE_L > size) || (RM_CELLULAR_NVM_CERTIFICATE_SIZE_H < size))
    {
        LogError(("Cellular_WriteCertificate: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        if (AWS_CELLULAR_NVM_TYPE_CERTIFICATE == data_type)
        {
            (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),   //casst
                            "AT+SQNSNVW=\"%s\",%u,%u", "certificate", index, size);
        }
        else
        {
            (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),   //cast
                            "AT+SQNSNVW=\"%s\",%u,%u", "privatekey", index, size);
        }

        pktStatus = _Cellular_AtcmdDataSend(p_context,
                                            atReqWriteCert,
                                            atDataReqWriteCert,
                                            socketSendDataPrefix,
                                            NULL,
                                            timeout,
                                            timeout,
                                            RM_CELLULAR_RYZ_DATA_SEND_INTER_DELAY_MS);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_WriteCertificate: couldn't resolve certificate write."));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

CellularError_t Cellular_EraseCertificate(CellularHandle_t                 cellularHandle,
                                           const e_aws_cellular_nvm_type_t data_type,
                                           const uint8_t                   index)
{
    CellularContext_t * p_context      = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqFirmUpgrade =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_EraseCertificate: _Cellular_CheckLibraryStatus failed"));
    }
    else if (((AWS_CELLULAR_NVM_TYPE_CERTIFICATE != data_type) &&
                (AWS_CELLULAR_NVM_TYPE_PRIVATEKEY != data_type)) ||
                (RM_CELLULAR_MAX_NVM_CERTIFICATE_INDEX < index))
    {
        LogError(("Cellular_EraseCertificate: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        if (AWS_CELLULAR_NVM_TYPE_CERTIFICATE == data_type)
        {
            (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),   //cast
                                "AT+SQNSNVW=\"%s\",%d,0\r", "certificate", index);
        }
        else
        {
            (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),   //cast
                                "AT+SQNSNVW=\"%s\",%d,0\r", "privatekey", index);
        }

        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqFirmUpgrade);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_EraseCertificate: couldn't resolve erace certificate"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

