renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

CellularError_t Cellular_GetCertificate(CellularHandle_t                 cellularHandle,
                                         const e_aws_cellular_nvm_type_t data_type,
                                         const uint8_t                   index,
                                         const uint8_t                 * p_buff,
                                         const uint32_t                  buff_length)
{
    CellularContext_t * p_context      = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqGetCert =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_WITH_PREFIX,
        "+SQNSNVR",
        _Cellular_RecvFuncGetCertificate,
        (void *)p_buff,    //cast
        buff_length,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_GetCertificate: _Cellular_CheckLibraryStatus failed"));
    }
    else if (((AWS_CELLULAR_NVM_TYPE_CERTIFICATE != data_type) &&
                (AWS_CELLULAR_NVM_TYPE_PRIVATEKEY != data_type)) ||
                (RM_CELLULAR_MAX_NVM_CERTIFICATE_INDEX < index) ||
                (NULL == p_buff))
    {
        LogError(("Cellular_GetCertificate: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        if (AWS_CELLULAR_NVM_TYPE_CERTIFICATE == data_type)
        {
            (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),   //cast
                                "AT+SQNSNVR=\"%s\",%d", "certificate", index);
        }
        else
        {
            (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),   //cast
                                "AT+SQNSNVR=\"%s\",%d", "privatekey", index);
        }

        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqGetCert);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_GetCertificate: couldn't resolve get certificate"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncGetCertificate(CellularContext_t                  * p_context,
                                                             const CellularATCommandResponse_t * p_atresp,
                                                             void                              * p_data,
                                                             uint16_t                            dataLen)
{
    (void)dataLen;

    uint8_t       * p_inputline = NULL;
    uint8_t       * p_Token     = NULL;
    const uint8_t * p_Delimiter = ",";

    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus = CELLULAR_AT_SUCCESS;

    if (NULL == p_context)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((NULL == p_atresp) || (NULL == p_atresp->pItm) || (NULL == p_atresp->pItm->pLine))
    {
        LogError(("_Cellular_RecvFuncGetCertificate: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        p_inputline = (uint8_t *)p_atresp->pItm->pLine; //cast

        atCoreStatus = _Cellular_ATGetSpecificNextTok(&p_inputline,
                                                      p_Delimiter,
                                                      &p_Token);

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = _Cellular_ATGetSpecificNextTok(&p_inputline,
                                                          p_Delimiter,
                                                          &p_Token);
        }

        if (CELLULAR_AT_SUCCESS != atCoreStatus)
        {
            pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
        }
    }

    if (CELLULAR_PKT_STATUS_OK == pktStatus)
    {
        if (dataLen > strlen((char *)p_inputline))  //cast
        {
            sprintf(p_data, "%s", p_inputline);
        }
        else
        {
            LogError(("_Cellular_RecvFuncGetCertificate: Buffer size is small"));
        }
    }
    else
    {
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }

    return pktStatus;
}

static CellularATError_t _Cellular_ATGetSpecificNextTok(uint8_t      ** pp_String,
                                                        const uint8_t * p_Delimiter,
                                                        uint8_t      ** pp_TokOutput)
{
    uint16_t  tokStrLen  = 0;
    uint16_t  dataStrlen = 0;
    uint8_t * p_tok      = NULL;

    CellularATError_t atStatus = CELLULAR_AT_SUCCESS;

    if ((NULL == pp_String) || (NULL == p_Delimiter) || (NULL == pp_TokOutput))
    {
        atStatus = CELLULAR_AT_BAD_PARAMETER;
    }

    if (CELLULAR_AT_SUCCESS == atStatus)
    {
        dataStrlen = (uint16_t)strlen((char *)*pp_String);  //cast

        if ((**pp_String) == (*p_Delimiter))
        {
            **pp_String = '\0';
            p_tok       = *pp_String;
        }
        else
        {
            p_tok = (uint8_t *)strtok((char *)*pp_String, (char *)p_Delimiter);    //cast
        }
    }

    if (CELLULAR_AT_SUCCESS == atStatus)
    {
        tokStrLen = (uint16_t)strlen((char *)p_tok);    //cast

        if ((tokStrLen < dataStrlen) && ('\0' != (*pp_String)[tokStrLen + 1U]))
        {
            *pp_String = &p_tok[strlen((char *)p_tok) + 1U];    //cast
        }
        else
        {
            *pp_String = &p_tok[strlen((char *)p_tok)];    //cast
        }

        *pp_TokOutput = p_tok;
    }

    return atStatus;
}

CellularError_t Cellular_ConfigSSLProfile(CellularHandle_t                       cellularHandle,
                                           const uint8_t                         security_profile_id,
                                           const e_aws_cellular_validate_level_t cert_valid_level,
                                           const uint8_t                         ca_certificate_id,
                                           const uint8_t                         client_certificate_id,
                                           const uint8_t                         client_privatekey_id)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};
    uint8_t             arg[3][3]                        = {'\0'};

