renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
    CellularAtReq_t atReqFirmUpgrade =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_ConfigSSLProfile: _Cellular_CheckLibraryStatus failed"));
    }
    else if ((RM_CELLULAR_SECURITY_PROFILE_ID_L > security_profile_id) ||
            (RM_CELLULAR_SECURITY_PROFILE_ID_H < security_profile_id) ||
                ((AWS_CELLULAR_NO_CERT_VALIDATE        != cert_valid_level) &&
                (AWS_CELLULAR_VALIDATE_CERT_EXPDATE    != cert_valid_level) &&
                (AWS_CELLULAR_VALIDATE_CERT_EXPDATE_CN != cert_valid_level)))
    {
        LogError(("Cellular_ConfigSSLProfile: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        if (RM_CELLULAR_MAX_NVM_CERTIFICATE_INDEX >= ca_certificate_id)
        {
            sprintf((char *)arg[0], "%d", ca_certificate_id);   //cast
        }
        else
        {
            arg[0][0] = '\0';
        }

        if (RM_CELLULAR_MAX_NVM_CERTIFICATE_INDEX >= client_certificate_id)
        {
            sprintf((char *)arg[1], "%d", client_certificate_id); //cast
        }
        else
        {
            arg[1][0] =  '\0';
        }

        if (RM_CELLULAR_MAX_NVM_CERTIFICATE_INDEX >= client_privatekey_id)
        {
            sprintf((char *)arg[2], "%d", client_privatekey_id); //cast
        }
        else
        {
            arg[2][0] =  '\0';
        }

        (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),   //cast
                        "AT+SQNSPCFG=%d,2,,%d,%s,%s,%s,\"\"",
                        security_profile_id,
                        cert_valid_level,
                        arg[0], arg[1], arg[2]);

        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqFirmUpgrade);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_ConfigSSLProfile: couldn't resolve config ssl profile"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_AutoAPConnectConfig */
CellularError_t Cellular_AutoAPConnectConfig(CellularHandle_t              cellularHandle,
                                             const e_aws_cellular_auto_connect_t type)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqAutoConfig =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_AutoAPConnectConfig: _Cellular_CheckLibraryStatus failed"));
    }
    else if ((AWS_CELLULAR_DISABLE_AUTO_CONNECT != type) &&
                (AWS_CELLULAR_ENABLE_AUTO_CONNECT != type))
    {
        LogError(("Cellular_AutoAPConnectConfig: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),   //cast
                        "AT+SQNAUTOCONNECT=%d", type);
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqAutoConfig);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_AutoAPConnectConfig: couldn't resolve auto ap connect config"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_UnlockSIM */
CellularError_t Cellular_UnlockSIM(CellularHandle_t      cellularHandle,
                                   const uint8_t * const p_pass)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    uint8_t             resBuf[20]     = {'\0'};
    int32_t             funclevel      = 0;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqFuncGetString =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_WITH_PREFIX,
        "+CFUN",
        _Cellular_RecvFuncGetString,
        resBuf,
        sizeof(resBuf),
    };

    CellularAtReq_t atReqCommon =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_UnlockSIM: _Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == p_pass)
    {
        LogError(("Cellular_UnlockSIM: Bad input Parameter "));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CFUN?");  //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqFuncGetString);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_UnlockSIM: couldn't resolve func check"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }
        else
        {
            sscanf((char *)resBuf, "%d", &funclevel);  //cast
        }

