renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if ((CELLULAR_SUCCESS == cellularStatus) &&
            ((AWS_CELLULAR_MODULE_OPERATING_LEVEL1 != funclevel) &&
             (AWS_CELLULAR_MODULE_OPERATING_LEVEL4 != funclevel)))
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CFUN=4");  //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqCommon);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_UnlockSIM: couldn't resolve set func"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        Platform_Delay(1000);   //cast

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CPIN?");  //cast
        atReqFuncGetString.pAtRspPrefix = "+CPIN";

        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqFuncGetString);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_UnlockSIM: couldn't resolve get lock state"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if ((CELLULAR_SUCCESS == cellularStatus) && (NULL == strstr((char *)resBuf, "READY")))  //cast
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CPIN=\"%s\"", (char *)p_pass);  //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqCommon);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_UnlockSIM: couldn't resolve unlock sim"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncGetString(CellularContext_t                 * p_context,
                                                       const CellularATCommandResponse_t * p_atresp,
                                                       void                              * p_data,
                                                       uint16_t                            dataLen)
{
    (void)dataLen;

    uint8_t * p_token     = NULL;
    uint8_t * p_inputline = NULL;

    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus = CELLULAR_AT_SUCCESS;

    if (NULL == p_context)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((NULL == p_atresp) || (NULL == p_atresp->pItm) || (NULL == p_atresp->pItm->pLine))
    {
        LogError(("_Cellular_RecvFuncGetString: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        p_inputline  = (uint8_t *)p_atresp->pItm->pLine;    //cast
        atCoreStatus = Cellular_ATRemovePrefix((char **)&p_inputline);  /* Fixed build error on CC-RL. */

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllDoubleQuote((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllWhiteSpaces((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATGetNextTok((char **)&p_inputline, (char **)&p_token);  /* Fixed build error on CC-RL. */
        }

        if (CELLULAR_AT_SUCCESS != atCoreStatus)
        {
            pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
        }
    }

    if ((CELLULAR_PKT_STATUS_OK == pktStatus) && (NULL != p_data) && (NULL != p_token))
    {
        (void)strcpy((char *)p_data, (char *)p_token);  //cast
    }
    else
    {
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }

    return pktStatus;
}

/* Implementation of Cellular_FactoryReset */
CellularError_t Cellular_FactoryReset(CellularHandle_t cellularHandle)
{
    CellularContext_t      * p_context       = (CellularContext_t *)cellularHandle;
    CellularError_t          cellularStatus  = CELLULAR_SUCCESS;
    CellularPktStatus_t      pktStatus       = CELLULAR_PKT_STATUS_OK;
    CellularPdnContextInfo_t pdpContextsInfo = {0};
    uint8_t                  cnt             = 0;
    uint8_t                  cnt_res         = RM_CELLULAR_RYZ_MAX_PDP_CONTEXTS;
    BaseType_t               semaphore_ret   = 0;

    uint8_t cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqCommon =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    CellularAtReq_t atReqGetCurrentApnName =
    {
        "AT+CGDCONT?",
        CELLULAR_AT_MULTI_WITH_PREFIX,
        "+CGDCONT",
        _Cellular_RecvFuncGetPdpContextSettings,
        &pdpContextsInfo,
        sizeof(CellularPdnContextInfo_t),
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_FactoryReset: _Cellular_CheckLibraryStatus failed"));
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CGDCONT?");  //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqGetCurrentApnName);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_FactoryReset: couldn't resolve AT+CGDCONT?"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }
        else
        {
            /* WAIT_LOOP */
            for (cnt = RM_CELLULAR_RYZ_MAX_PDP_CONTEXTS; cnt > 0; cnt--)
            {
                if (false == pdpContextsInfo.contextsPresent[cnt - 1])
                {
                    cnt_res = cnt;
                    cnt     = 1;    /* Exit this For Loop to set "1" */
                }
            }
        }

