renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf),    //cast
                        "AT+CGDCONT=%d,\"IPV4V6\",\"%s\"", cnt_res, "RESET");
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqCommon);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_FactoryReset: couldn't resolve AT+CGDCONT"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        cellularStatus = aws_cellular_psm_config(p_context, 0);

        if (CELLULAR_SUCCESS != cellularStatus)
        {
            LogError(("Cellular_FactoryReset: couldn't resolve psm config"));
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        cellularStatus = aws_cellular_closesocket(p_context);

        if (CELLULAR_SUCCESS == cellularStatus)
        {
            (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+SQNSFACTORYRESET");   //cast
            (void)_Cellular_AtcmdRequestWithCallback(p_context, atReqCommon);
            cellularStatus = aws_cellular_hardreset(p_context);
        }
        else
        {
            LogError(("Cellular_FactoryReset: couldn't resolve close socket"));
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        memset((void *)&pdpContextsInfo, 0x00, sizeof(CellularPdnContextInfo_t));   //cast
        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CGDCONT?");    //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqGetCurrentApnName);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_FactoryReset: couldn't resolve AT+CGDCONT?"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }
        else
        {
            if ((false != pdpContextsInfo.contextsPresent[cnt_res - 1]) &&
                (0     == strncmp((char *)pdpContextsInfo.apnName[cnt_res - 1], "RESET", 5)))  //cast
            {
                LogError(("Cellular_FactoryReset: couldn't resolve factory reset"));
                cellularStatus = CELLULAR_UNKNOWN;
            }
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_SetBaudrate */
CellularError_t Cellular_SetBaudrate(CellularHandle_t cellularHandle,
                                     const uint32_t   baudrate)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    sci_err_t           sci_ret        = SCI_SUCCESS;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqQuery =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_SetBaudrate: _Cellular_CheckLibraryStatus failed"));
    }
    else if (0 == baudrate)
    {
        LogError(("Cellular_SetBaudrate: Invalid argument"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CFUN=5");  //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqQuery);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetBaudrate: couldn't resolve %s", cmdBuf));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),
                        "AT+SQNHWCFG=\"uart0\",\"enable\",\"rtscts\",\"%u\",\"8\",\"none\",\"1\",\"at\"", baudrate);
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqQuery);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetBaudrate: couldn't resolve %s", cmdBuf));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        sci_ret = aws_cellular_temp_close(cellularHandle);

        if (SCI_SUCCESS == sci_ret)
        {
            sci_ret = aws_cellular_serial_reopen(cellularHandle, baudrate);
        }
        else
        {
            cellularStatus = CELLULAR_UNKNOWN;
        }

        if (SCI_SUCCESS == sci_ret)
        {
            cellularStatus = aws_cellular_hardreset(p_context);
        }
        else
        {
            cellularStatus = CELLULAR_UNKNOWN;
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_StartUpLink */
CellularError_t Cellular_StartUpLink(CellularHandle_t    cellularHandle,
                                     const uint8_t       enable,
                                     const uint16_t      earfcn,
                                     const uint32_t      level)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

