renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
    CellularAtReq_t atReqQueryStartUpLink =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_StartUpLink: _Cellular_CheckLibraryStatus failed"));
    }
    else if (1 < enable)
    {
        LogError(("Cellular_StartUpLink: Invalid argument"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CFUN=5");  //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqQueryStartUpLink);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_StartUpLink: couldn't resolve Start Up Link"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),   //cast
                        "AT+SMCWTX=%u,%u,%u", enable, earfcn, level);
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqQueryStartUpLink);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_StartUpLink: couldn't resolve Start Up Link"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_StartDownLink */
CellularError_t Cellular_StartDownLink(CellularHandle_t    cellularHandle,
                                       const uint16_t      earfcn)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReq =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    CellularAtReq_t atReqQueryStartDownLink =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_WITH_PREFIX,
        "+SMCWRX",
        _Cellular_RecvFuncStartDownLink,
        NULL,  //cast
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_StartDownLink: _Cellular_CheckLibraryStatus failed"));
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CFUN=5");  //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReq);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_StartDownLink: couldn't resolve Start Down Link"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+SMCWRX=%d", earfcn);   //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqQueryStartDownLink);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_StartDownLink: couldn't resolve Start Down Link"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncStartDownLink(CellularContext_t                 * p_context,
                                                           const CellularATCommandResponse_t * p_atresp,
                                                           void                              * p_data,
                                                           uint16_t                            dataLen)
{
    (void)dataLen;

    uint8_t * p_inputline = NULL;

    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus = CELLULAR_AT_SUCCESS;

    if (NULL == p_context)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((NULL == p_atresp) || (NULL == p_atresp->pItm) || (NULL == p_atresp->pItm->pLine))
    {
        LogError(("_Cellular_RecvFuncStartDownLink: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        p_inputline = (uint8_t *)p_atresp->pItm->pLine; //cast
        atCoreStatus = Cellular_ATRemovePrefix((char **)&p_inputline);  /* Fixed build error on CC-RL. */

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllDoubleQuote((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllWhiteSpaces((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS != atCoreStatus)
        {
            pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
        }
    }

    if (CELLULAR_PKT_STATUS_OK == pktStatus)
    {
        *(int32_t *)p_data = atoi((char *)p_inputline); //cast
    }
    else
    {
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }

    return pktStatus;
}

/* Implementation of Cellular_SetPsmSettings */
CellularError_t Cellular_SetPsmSettings(CellularHandle_t              cellularHandle,
                                        const CellularPsmSettings_t * pPsmSettings)
{
    CellularContext_t      * p_context  = (CellularContext_t *)cellularHandle;                  //cast
    st_aws_cellular_ctrl_t * p_aws_ctrl = (st_aws_cellular_ctrl_t *)p_context->pModueContext;   //cast

