renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
    CellularError_t cellularStatus = CELLULAR_SUCCESS;
    BaseType_t      semaphore_ret  = 0;

    /* Make sure the library is open. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("_Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == pPsmSettings)
    {
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        cellularStatus = aws_cellular_psm_config(p_context, pPsmSettings->mode);

        if (CELLULAR_SUCCESS == cellularStatus)
        {
            cellularStatus = Cellular_CommonSetPsmSettings(cellularHandle, pPsmSettings);
        }

        if ((CELLULAR_SUCCESS == cellularStatus) && (1 == pPsmSettings->mode))
        {
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 1
            aws_cellular_rts_hw_flow_disable();
#endif
            aws_cellular_rts_ctrl(1);
            p_aws_ctrl->psm_mode = 1;
        }
        else
        {
            aws_cellular_psm_config(p_context, 0);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_GetSVN */
CellularError_t Cellular_GetSVN(CellularHandle_t    cellularHandle,
                                const st_aws_cellular_svn_t * p_svn)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqQueryGetSVN =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_MULTI_WO_PREFIX,
        NULL,
        _Cellular_RecvFuncGetSVN,
        NULL,
        sizeof(st_aws_cellular_svn_t),
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_GetSVN: _Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == p_svn)
    {
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        atReqQueryGetSVN.pData = (void *)p_svn; //cast

        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "ATI1");  //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqQueryGetSVN);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_GetSVN: couldn't resolve ATI1 command"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncGetSVN(CellularContext_t                 * p_context,
                                                    const CellularATCommandResponse_t * p_atresp,
                                                    void                              * p_data,
                                                    uint16_t                            dataLen)
{
    (void)dataLen;

    st_aws_cellular_svn_t * p_svn       = p_data;
    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;

    if (NULL == p_context)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((NULL == p_atresp) || (NULL == p_atresp->pItm) || (NULL == p_atresp->pItm->pLine))
    {
        LogError(("_Cellular_RecvFuncGetSVN: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        (void)snprintf((char *)p_svn->ue_svn, AWS_CELLULAR_MAX_UE_SVN_LENGTH, p_atresp->pItm->pLine);           //cast
        (void)snprintf((char *)p_svn->lr_svn, AWS_CELLULAR_MAX_LR_SVN_LENGTH, p_atresp->pItm->pNext->pLine);    //cast
    }

    return pktStatus;
}

/* Implementation of Cellular_SetEidrxSettingsEXT */
CellularError_t Cellular_SetEidrxSettingsEXT(CellularHandle_t                cellularHandle,
                                             const CellularEidrxSettings_t * p_eidrxsettings)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqSetEidrx =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogError(("_Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == p_eidrxsettings)
    {
        LogError(("Cellular_CommonSetEidrxSettings : Bad parameter"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf),    //cast
                        "%s%d,%d,\"" PRINTF_BINARY_PATTERN_INT4 "\",\"" PRINTF_BINARY_PATTERN_INT4 "\"",
                        "AT+SQNEDRX=",
                        p_eidrxsettings->mode,
                        p_eidrxsettings->rat,
                        PRINTF_BYTE_TO_BINARY_INT4(p_eidrxsettings->requestedEdrxVaue),
                        PRINTF_BYTE_TO_BINARY_INT4(p_eidrxsettings->pagingTimeWindow));

        LogDebug(("Eidrx setting: %s ", cmdBuf));
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqSetEidrx);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("_Cellular_SetEidrxSettings: couldn't set Eidrx settings"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

