renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
    return cellularStatus;
}

/* Implementation of Cellular_GetSocketDataSize */
CellularError_t Cellular_GetSocketDataSize(CellularHandle_t        cellularHandle,
                                            CellularSocketHandle_t socketHandle,
                                            const uint16_t       * p_size)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReqQueryStartUpLink =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_WITH_PREFIX,
        "+SQNSI",
        _Cellular_RecvFuncGetSocketDataSize,
        (void *)p_size,  //cast
        sizeof(uint16_t),
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_GetSocketDataSize: _Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == socketHandle)
    {
        LogDebug(("Cellular_GetSocketDataSize: Invalid argument"));
        cellularStatus = CELLULAR_INVALID_HANDLE;
    }
    else if (NULL == p_size)
    {
        LogDebug(("Cellular_GetSocketDataSize: Invalid argument"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+SQNSI=%ld", socketHandle->socketId + 1);  //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqQueryStartUpLink);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_GetSocketDataSize: couldn't resolve %s command", cmdBuf));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncGetSocketDataSize(CellularContext_t                 * p_context,
                                                               const CellularATCommandResponse_t * p_atresp,
                                                               void                              * p_data,
                                                               uint16_t                            dataLen)
{
    (void)dataLen;

    uint16_t * p_ret       = p_data;
    uint8_t  * p_inputline = NULL;
    uint8_t  * p_token     = NULL;

    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus = CELLULAR_AT_SUCCESS;

    if (NULL == p_context)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((NULL == p_atresp) || (NULL == p_atresp->pItm) || (NULL == p_atresp->pItm->pLine))
    {
        LogError(("_Cellular_RecvFuncGetSocketDataSize: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        p_inputline  = (uint8_t *)p_atresp->pItm->pLine;                //cast
        atCoreStatus = Cellular_ATRemovePrefix((char **)&p_inputline);  /* Fixed build error on CC-RL. */

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllDoubleQuote((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllWhiteSpaces((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            /* Get connId */
            atCoreStatus = Cellular_ATGetNextTok((char **)&p_inputline, (char **)&p_token);  /* Fixed build error on CC-RL. */
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            /* Get sent */
            atCoreStatus = Cellular_ATGetNextTok((char **)&p_inputline, (char **)&p_token);  /* Fixed build error on CC-RL. */
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            /* Get received */
            atCoreStatus = Cellular_ATGetNextTok((char **)&p_inputline, (char **)&p_token);  /* Fixed build error on CC-RL. */
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            /* Get buff_in */
            atCoreStatus = Cellular_ATGetNextTok((char **)&p_inputline, (char **)&p_token);  /* Fixed build error on CC-RL. */
        }

        if ((CELLULAR_AT_SUCCESS == atCoreStatus) && (NULL != p_token))
        {
            *p_ret = (uint16_t)atoi((char *)p_token);    //cast
        }

        if (CELLULAR_AT_SUCCESS != atCoreStatus)
        {
            pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
        }
    }

    return pktStatus;
}

/* Implementation of Cellular_SetServiceStatus */
CellularError_t Cellular_SetServiceStatus(CellularHandle_t cellularHandle)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReq =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_SetServiceStatus: _Cellular_CheckLibraryStatus failed"));
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+COPS=0");
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReq);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetServiceStatus: couldn't resolve AT+COPS"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

