renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_SetRAT */
CellularError_t Cellular_SetRAT(CellularHandle_t           cellularHandle,
                                const e_aws_cellular_rat_t rat)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;
    uint8_t             cnt            = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    st_aws_cellular_ctrl_t * p_aws_ctrl = (st_aws_cellular_ctrl_t *)cellularHandle->pModueContext;   //cast

    CellularAtReq_t atReq =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_SetRAT: _Cellular_CheckLibraryStatus failed"));
    }
    else if ((AWS_CELLULAR_RAT_CATM1 != rat) && (AWS_CELLULAR_RAT_NBIOT != rat))
    {
        LogError(("Cellular_SetRAT : Bad parameter"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CFUN=0");
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReq);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetRAT: couldn't resolve AT+CFUN=0"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+SQNMODEACTIVE=%d", rat);
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReq);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetRAT: couldn't resolve AT+SQNMODEACTIVE=%d", rat));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT^RESET");
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReq);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetRAT: couldn't resolve AT^RESET"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }
        else
        {
            /* WAIT_LOOP */
            while (1)
            {
                if (AWS_CELLULAR_MODULE_START_FLG == p_aws_ctrl->module_flg)
                {
                    p_aws_ctrl->module_flg = AWS_CELLULAR_MODULE_FLG_INIT;
                    break;
                }
                else
                {
                    cnt++;
                    Platform_Delay(1000);   //cast
                }

                if (cnt >= AWS_CELLULAR_RESTART_LIMIT)
                {
                    cellularStatus = CELLULAR_MODEM_NOT_READY;
                    break;
                }
            }
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

/* Implementation of Cellular_GetRAT */
CellularError_t Cellular_GetRAT(CellularHandle_t             cellularHandle,
                                const e_aws_cellular_rat_t * p_rat)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReq =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_WITH_PREFIX,
        "+SQNMODEACTIVE",
        _Cellular_RecvFuncGetRAT,
        (void *)p_rat,
        sizeof(uint8_t *),
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_GetRAT: _Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == p_rat)
    {
        LogError(("Cellular_GetRAT : Bad parameter"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+SQNMODEACTIVE?");
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReq);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_GetRAT: couldn't resolve AT+SQNMODEACTIVE?"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncGetRAT(CellularContext_t                 * p_context,
                                                    const CellularATCommandResponse_t * p_atresp,
                                                    void                              * p_data,
                                                    uint16_t                            dataLen)
{
    (void)dataLen;

    e_aws_cellular_rat_t * p_ret       = p_data;
    uint8_t              * p_inputline = NULL;
    uint8_t              * p_token     = NULL;

    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus = CELLULAR_AT_SUCCESS;

    if (NULL == p_context)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((NULL == p_atresp) || (NULL == p_atresp->pItm) || (NULL == p_atresp->pItm->pLine))
    {
        LogError(("_Cellular_RecvFuncGetRAT: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        p_inputline  = (uint8_t *)p_atresp->pItm->pLine;                //cast
        atCoreStatus = Cellular_ATRemovePrefix((char **)&p_inputline);   //cast

