renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllWhiteSpaces((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            /* Get RAT */
            atCoreStatus = Cellular_ATGetNextTok((char **)&p_inputline, (char **)&p_token);   //cast
        }

        if ((CELLULAR_AT_SUCCESS == atCoreStatus) && (NULL != p_token))
        {
            *p_ret = (e_aws_cellular_rat_t)atoi((char *)p_token);    //cast
        }

        if (CELLULAR_AT_SUCCESS != atCoreStatus)
        {
            pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
        }
    }

    return pktStatus;
}

/* Implementation of Cellular_GetSupportRAT */
CellularError_t Cellular_GetSupportRAT(CellularHandle_t                      cellularHandle,
                                       const st_aws_cellular_support_rat_t * p_support)
{
    CellularContext_t * p_context      = (CellularContext_t *)cellularHandle;
    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReq =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_WITH_PREFIX,
        "+SQNMODEACTIVE",
        _Cellular_RecvFuncGetSupportRAT,
        (void *)p_support,
        sizeof(st_aws_cellular_support_rat_t),
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_GetSupportRAT: _Cellular_CheckLibraryStatus failed"));
    }
    else if (NULL == p_support)
    {
        LogError(("Cellular_GetSupportRAT : Bad parameter"));
        cellularStatus = CELLULAR_BAD_PARAMETER;
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+SQNMODEACTIVE=?");
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReq);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_GetSupportRAT: couldn't resolve AT+SQNMODEACTIVE=?"));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

static CellularPktStatus_t _Cellular_RecvFuncGetSupportRAT(CellularContext_t                 * p_context,
                                                           const CellularATCommandResponse_t * p_atresp,
                                                           void                              * p_data,
                                                           uint16_t                            dataLen)
{
    (void)dataLen;

    st_aws_cellular_support_rat_t * p_ret = p_data;

    uint8_t  * p_inputline = NULL;
    uint8_t  * p_token     = NULL;

    CellularPktStatus_t pktStatus    = CELLULAR_PKT_STATUS_OK;
    CellularATError_t   atCoreStatus = CELLULAR_AT_SUCCESS;

    if (NULL == p_context)
    {
        pktStatus = CELLULAR_PKT_STATUS_INVALID_HANDLE;
    }
    else if ((NULL == p_atresp) || (NULL == p_atresp->pItm) || (NULL == p_atresp->pItm->pLine))
    {
        LogError(("_Cellular_RecvFuncGetRAT: Input Line passed is NULL"));
        pktStatus = CELLULAR_PKT_STATUS_FAILURE;
    }
    else
    {
        p_inputline  = (uint8_t *)p_atresp->pItm->pLine;                //cast
        atCoreStatus = Cellular_ATRemovePrefix((char **)&p_inputline);   //cast

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllWhiteSpaces((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            atCoreStatus = Cellular_ATRemoveAllDoubleQuote((char *)p_inputline);    //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            /* Get Mode */
            atCoreStatus = Cellular_ATGetNextTok((char **)&p_inputline, (char **)&p_token);   //cast
        }

        if (CELLULAR_AT_SUCCESS == atCoreStatus)
        {
            /* Get Support RAT */
            if (NULL != strstr((char *)p_inputline, "1"))   //cast
            {
                p_ret->lte_m = true;
            }

            if (NULL != strstr((char *)p_inputline, "2"))   //cast
            {
                p_ret->nb_iot = true;
            }

            pktStatus = _Cellular_TranslateAtCoreStatus(atCoreStatus);
        }
    }

    return pktStatus;
}

/* Implementation of Cellular_SetHWConfig */
CellularError_t Cellular_SetHWConfig(CellularHandle_t cellularHandle)
{
    CellularContext_t      * p_context  = (CellularContext_t *) cellularHandle;                  //cast
    st_aws_cellular_ctrl_t * p_aws_ctrl = (st_aws_cellular_ctrl_t *)p_context->pModueContext;    //cast

    CellularError_t     cellularStatus = CELLULAR_SUCCESS;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;
    BaseType_t          semaphore_ret  = 0;

    uint8_t             count          = 0;
    uint8_t             cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReq =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);

    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_GetSupportRAT: _Cellular_CheckLibraryStatus failed"));
    }
    else
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT+CFUN=5");  //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReq);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetHWConfig: couldn't resolve %s", cmdBuf));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

