renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_ryz_aws/cellular_ryz_api.c
        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void) snprintf((char *)cmdBuf, sizeof(cmdBuf),
                        "AT+SQNHWCFG=\"uart1\",\"enable\",\"rtscts\",\"921600\",\"8\",\"none\",\"1\",\"dcp\"");
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReq);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetHWConfig: couldn't resolve %s", cmdBuf));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    if (CELLULAR_SUCCESS == cellularStatus)
    {
        semaphore_ret = aws_cellular_rts_deactive(p_context);

        (void)snprintf((char *)cmdBuf, sizeof(cmdBuf), "AT^RESET");   //cast
        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReq);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetHWConfig: couldn't resolve %s", cmdBuf));
            cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
        }
        else
        {
            count = 0;

            /* WAIT_LOOP */
            while (1)
            {
                if (AWS_CELLULAR_MODULE_START_FLG == p_aws_ctrl->module_flg)
                {
                    p_aws_ctrl->module_flg = AWS_CELLULAR_MODULE_FLG_INIT;
                    break;
                }
                else
                {
                    count++;
                    Platform_Delay(1000);   //cast
                }

                if (count >= AWS_CELLULAR_RESTART_LIMIT)
                {
                    cellularStatus = CELLULAR_TIMEOUT;
                    break;
                }
            }
        }

        aws_cellular_rts_active(p_context, semaphore_ret);
    }

    return cellularStatus;
}

#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
CellularError_t Cellular_ConfigTlslSocket(CellularHandle_t cellularHandle,
                                          const uint8_t    socket_id,
                                          const bool       enable,
                                          const uint8_t    security_profile_id)
{
    CellularContext_t * p_context = (CellularContext_t *) cellularHandle;
    CellularError_t     cellularStatus;
    CellularPktStatus_t pktStatus;
    char                cmdBuf[CELLULAR_AT_CMD_MAX_SIZE] = {'\0'};

    CellularAtReq_t atReq;
    atReq.pAtCmd       = cmdBuf;
    atReq.atCmdType    = CELLULAR_AT_NO_RESULT;
    atReq.pAtRspPrefix = NULL;
    atReq.respCallback = NULL;
    atReq.pData        = NULL;
    atReq.dataLen      = 0;

    if ((RM_CELLULAR_SECURITY_PROFILE_ID_L > security_profile_id) ||
        (RM_CELLULAR_SECURITY_PROFILE_ID_H < security_profile_id))
    {
        LogError(("Cellular_ConfigTlslSocket: Bad input Parameter "));
        return (CELLULAR_BAD_PARAMETER);
    }

    if ((0 == socket_id) || (CELLULAR_NUM_SOCKET_MAX < socket_id))
    {
        LogError(("Cellular_ConfigTlslSocket: Bad input Parameter "));
        return (CELLULAR_BAD_PARAMETER);
    }

    /* p_context is checked in _Cellular_CheckLibraryStatus function. */
    cellularStatus = _Cellular_CheckLibraryStatus(p_context);
    if (CELLULAR_SUCCESS != cellularStatus)
    {
        LogDebug(("Cellular_ConfigTlslSocket : _Cellular_CheckLibraryStatus failed"));
        return (cellularStatus);
    }

    (void)snprintf(cmdBuf, CELLULAR_AT_CMD_MAX_SIZE, "AT+SQNSSCFG=%d,%d,%d\r",
                   socket_id, enable, security_profile_id);
    pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReq);
    if (CELLULAR_PKT_STATUS_OK != pktStatus)
    {
        LogError(("Cellular_ConfigTlslSocket: couldn't resolve TLS configuration"));
    }

    cellularStatus = _Cellular_TranslatePktStatus(pktStatus);
    return cellularStatus;
}
#endif
